Repository: quazaa-development-team/Shareaza
Catalog: trunk/Languages/default-*.po
Languages: sq

source: Return to the Shareaza Home page
sq: Rikthen faqen zyrtare të Shareaza-s

source: Show the IRC Chat window.
sq: Tregon dritaren IRC të Chat-it.

source: View and manage your local content library.
sq: Tregon dhe menaxhon librarinë me përmbajtjen lokale.

source: Play audio and video media files from your library.
sq: Luan skedat mediatike filmike dhe zanore në librari.

source: See how well you are connected to the Network.
sq: Tregon sa mirë jeni i lidhur në Rrjet.

source: Search the network for files to download
sq: Kërkon në rrjet se çfarë do shkarkosh

source: Monitor uploads and downloads you are performing.
sq: Monitoron ngarkimin dhe shkarkimin e kryer.

source: Start downloading a new file or BitTorrent torrent...
sq: Nis shkarkimi i një skede të re ose i një torrenti BitTorrent...

source: Select the language you wish to use Shareaza in...
sq: Zgjedh gjuhën e parapëlqyer të Shareaza-s...

source: Edit your user profile...
sq: Editon profilin tënd...

source: Reload and apply your current skin selection.
sq: Ringarkon dhe zbaton veshjen aktuale të zgjedhur.

source: Configure Shareaza settings...
sq: Konfiguron vendosjet e Shareaza-s...

source: Choose a different skin for Shareaza to use...
sq: Zgjedh një veshje tjetër për t'u përdorur në Shareaza...

source: Open the Shareaza QuickStart wizard...
sq: Hap udhërrëfyesin e shpejtë në Shareaza...

source: Display Vertical Axis
sq: Tregon Boshtin Vertikal

source: Clear the traffic graph.
sq: Pastron grafikun e trafikut.

source: Display grid lines.
sq: Tregon pamje me rrjetë.

source: Display legend.
sq: Tregon legjendën.

source: Select and configure items to graph...
sq: Zgjedh të konfigurojë njësitë në grafik...

source: Open a new graph window...
sq: Hap një dritare të re grafike...

source: Access the selected download source(s) and attempt to download.
sq: Hyn në burimet e shkarkesës së zgjedhur dhe orvatet të shkarkojë.

source: Disconnect the selected download transfer(s).
sq: Shkëput transferimin për shkarkesën e zgjedhur.

source: Disconnect and forget the selected download source(s).
sq: Shkëput dhe harron burimet e shkarkesës së zgjedhur.

source: Open the Shareaza window.
sq: Hap pamjen e Shareaza-s.

source: Automatically clear uploads which have been completed.
sq: Pastron automatikisht ngarkesat që kanë përfunduar.

source: Clear the selected upload(s) from the list.
sq: Pastron nga lista ngarkesën e zgjedhur.

source: Clear uploads which have been completed.
sq: Pastron ngarkesat që kanë përfunduar.

source: Disconnect the selected upload transfer(s).
sq: Shkëput transferimin për ngarkesën e zgjedhur.

source: Show all uploads which are actively sending.
sq: Tregon tërë ngarkesat që dërgojnë në mënyrë aktive.

source: Show all uploads.
sq: Trego tërë ngarkesat.

source: Show uploads which are no longer connected.
sq: Tregon ngarkesat që nuk janë më të lidhura.

source: Choose which types of uploads to show and which types to hide in this view.
sq: Zgjedh llojet e ngarkesave që do të shfaqen dhe fshihen nga pamja.

source: Show uploads which are waiting in your queues.
sq: Tregon ngarkesën që pret në radhë.

source: Show BitTorrent uploads.
sq: Tregon ngarkesat e BitTorrent.

source: Launch the selected shared file(s).
sq: Lëshon skedën e zgjedhur që shpërndahet.

source: Configure upload settings...
sq: Konfiguron vendosjet e ngarkesës...

source: Start the selected queued upload(s).
sq: Nis ngarkesën e zgjedhur në radhën e pritjes.

source: Use Shareaza in Basic mode.
sq: Përdor Shareaza-n në mënyrën e Thjeshtë.

source: Show or hide the DISCOVERY SERVICES window.
sq: Tregon ose fsheh dritaren SHËRBIME ZBULUESE.

source: Show or hide the DOWNLOADS window.
sq: Tregon ose fsheh dritaren SHKARKIM.

source: Show or hide the HOST CACHE window.
sq: Tregon ose fsheh dritaren DEPO HOSTI.

source: Show or hide the LIBRARY window.
sq: Tregon ose fsheh dritaren LIBRARI.

source: Show or hide the MEDIA PLAYER window.
sq: Tregon ose fsheh dritaren MEDIALUAJTËS.

source: Show or hide the NEIGHBOURS window.
sq: Tregon ose fsheh dritaren HOSTE.

source: Show or hide the PACKET DUMP window.
sq: Tregon ose fsheh dritaren SKUTA PAKETE.

source: Show or hide the HIT MONITOR window.
sq: Tregon ose fsheh dritaren MONITORI I HITEVE.

source: Show or hide the SEARCH MONITOR window.
sq: Tregon ose fsheh dritare MONITORI I KËRKIMIT.

source: Show or hide the SECURITY window.
sq: Tregon ose fsheh dritaren SIGURI.

source: Show or hide the SYSTEM window.
sq: Tregon ose fsheh dritaren SISTEM.

source: Use Shareaza in power Tabbed mode (Home, Library, Media, Transfers, Network).
sq: Përdor Shareaza-n në mënyrë të avancuar të Lidhur (Shtëpi, Librari, MediaLuajtës, Transferim, Rrjet).

source: Show or hide a GRAPH window.
sq: Tregon ose fsheh dritaren GRAFIKË.

source: Show or hide the UPLOADS window.
sq: Tregon ose fsheh dritaren NGARKIM.

source: Use Shareaza in power Windowed mode.
sq: Përdor Shareaza-n në mënyrë të avancuar me Dritare.

source: Choose the web service to get more information about the selected file.
sq: Zgjedh shërbimin e rrjetit për të marrë më shumë informacion për skedën e zgjedhur.

source: Expand all open windows to fill the screen.
sq: Zgjeron tërë dritaret e hapura që ekrani të mbushet.

source: Show or hide the bandwidth monitor.
sq: Tregon ose fsheh monitorin e shtrirjes së bandës.

source: Show or hide the navigation bar.
sq: Tregon ose fsheh shufrën e lundrimit.

source: Show or hide the Shareaza Remote Control
sq: Tregon ose fsheh pultin e Shareaza-s

source: Show or hide the window tab bar.
sq: Tregon ose fsheh shufrën e lidhur të dritares.

source: Arrange open windows as horizontal, non-overlapping tiles.
sq: Radhit dritaret e hapura si horizontale, me tituj jombulues.

source: Arrange open windows as vertical, non-overlapping tiles.
sq: Radhit dritaret e hapura si vertikale, me tituj jombulues.

source: Show or hide the toolbar.
sq: Tregon ose fsheh shufrën e mjeteve.

source: Resize the image to fit within the window.
sq: Ripërmason imazhin që të jetë brenda dritares.

source: Show the image at its natural size.
sq: Tregon imazhin në masën e tij natyrale.

source: Refresh the image.
sq: Rifreskon imazhin.

source: Close the image viewer window.
sq: Mbyll dritaren e shikuesit të imazheve.

source: In the maximum mode the bandwidth won't exceed the specified value. In the average mode it will fluctuate around the value to both sides.
sq: Në mënyrën maksimale gjerësia e bandës nuk do e kalojë vlerën e përcaktuar. Në mënyrën mesatare ka një luhatje midis vlerës në të dyja anët.

source: Enter regular expressions in perl syntax.{n}The search keywords can be specified in a form of <n>, where n is number between 1 and 9. If you want to put all keywords each after other, use <_> markup.
sq: Shkruaj shprehje të rregullta sipas sintaksës perl.{n}Fjalët kyçe mund të përcaktohen sipas një forme <n>, ku n është numri midis 1 dhe 9. Nëse do t'i vendosësh tërë fjalët kyçe mbrapa njëra-tjetrës, përdor <_> shenjim.

source: This setting has no effect on downloads previously started, also this setting is ignored if the file have the eDonkey hash and the eDonkey network is enabled or if it is a torrent.{n}However this setting isn't ignored if the download is paused.{n}{n}ATTENTION: Use this option only in case of real necessity, if you abuse of the option you may be banned.
sq: Kjo vendosje nuk ka efekt te shkarkesat që kanë nisur më parë, po ashtu kjo vendosje përbuzet nëse skeda ka hashin eDonkey dhe rrjeti eDonkey është aktivizuar ose nëse është torrent.{n}Gjithsesi kjo vendosje nuk përbuzet nëse shkarkimi pushon.{n}{n}KUJDES: Përdore këtë mundësi vetëm në rast të një nevoje reale, nëse abuzon me mundësinë mund të dëbohesh.

source: System
sq: Sistem

source: Neighbours
sq: Fqinj

source: Packet Dump
sq: Paketa

source: Host Cache
sq: Depo Hosti

source: Search Monitor
sq: Monitori i Kërkimit

source: Hit Monitor
sq: Monitori i Hiteve

source: Graph
sq: Grafikë

source: Security
sq: Siguri

source: Discovery Services
sq: Shërbime Zbulimi

source: Browse
sq: Shfleto

source: Shareaza Home
sq: Shtëpi e Shareaza-s

source: Shareaza Help
sq: Ndihmë në Shareaza

source: Shareaza Chat
sq: Chat në Shareaza

source: Are you sure you want to delete this filter ?
sq: Je i sigurt për fshirjen e këtij filtri?

source: &Schemas
sq: &Skema

source: Multiple Values
sq: Vlera Shumëfishe

source: Multiple
sq: Shumëfishe

source: There already is a filter called "%s", do you want to replace it?
sq: Filtri i quajtur "%s" ekziston që më parë, do e zëvendësosh?

source: Please give your filter a name.
sq: Të lutem emërto filtrin tënd.

source: This template is invalid.
sq: Kjo tempujkë është jokorrekte.

source: This template does not have any customizations.
sq: Kjo tempujkë nuk të jep mundësi zgjedhjeje.

source: Are you sure you want to delete the "%s" template?\nThis cannot be undone.
sq: Je i sigurt për fshirjen e tempujkës "%s"?\nKjo nuk mund të kthehet!

source: Shareaza Settings
sq: Vendosjet e Shareaza-s

source: Welcome to Shareaza
sq: Mirë se erdhe te Shareaza

source: File Properties
sq: Vetitë e Skedës

source: Edit My Profile
sq: Edito Profilin Tim

source: !Welcome to Shareaza (version) !\n.\nShareaza is completely free software.\nPlease use it responsibly and respect intellectual property law.\n.
sq: Mirë se erdhe te Shareaza (version) !\n.\nShareaza është softuer tërësisht falas.\nTë lutem përdore me përgjegjësi dhe respekto ligjin për pronën intelektuale.\n.

source: (closing after transfers)
sq: (mbylle pas transferimit)

source: You're not connected. Click the Connect button to get started.
sq: Nuk je i lidhur. Që të nisësh, shtyp butonin Lidhu.

source: There are no active searches. Click here to search for files.
sq: Nuk ka asnjë kërkim aktiv. Kliko që të kërkosh një skedë.

source: Shareaza has finished downloading the next Shareaza version (%s). Would you like to upgrade now?\n\nIf you select Yes, Shareaza will close temporarily while the upgrade is installed.
sq: Shareaza mbaroi shkarkimin e versionit të ri (%s). Do e përmirësosh tani?\n\nNëse zgjedh Po, Shareaza do të mbyllet përkohësisht deri në instalimin e përmirësimit.

source: Are you sure you want to delete the "%s" skin? This cannot be undone.
sq: Je i sigurt për fshirjen e veshjes "%s"? Kjo nuk mund të kthehet.

source: Changing view will close any windows you have open. Would you like to change now?
sq: Ndryshimi i pamjes mbyll tërë dritaret e hapura. Je i sigurt për këtë?

source: No new Shareaza version detected.
sq: Nuk diktohet asnjë verion i ri i Shareaza-s.

source: Download Properties
sq: Vetitë e Shkarkimit

source: Hub/Ultrapeer mode with %lu neighbour(s). %s in local library.
sq: Mënyrë Nyjë/Ultrapikë me %lu hoste. %s në librarinë lokale.

source: Ultrapeer mode with %lu neighbour(s). %s in local library.
sq: Mënyrë Ultrapikë me %lu hoste. %s në librarinë lokale.

source: Hub mode with %lu neighbour(s). %s in local library.
sq: Mënyrë Nyjë me %lu hoste. %s në librarinë lokale.

source: Connected. %s in local library.
sq: I lidhur. %s në librarinë lokale.

source: Connected to %lu neighbour(s). %s in local library.
sq: I lidhur te %lu fqinjë. %s në librarinë lokale.

source: Connecting to the network...
sq: Lidhje në rrjet...

source: Not connected to the network.
sq: Nuk je i lidhur në Rrjet.

source: %s in : %s out [D:%I64i/U:%I64i]
sq: %s brenda : %s jashtë [S:%I64i/N:%I64i]

source: [H:%I64i] %s in : %s out [D:%I64i/U:%I64i]
sq: [H:%I64i] %s brenda : %s jashtë [S:%I64i/N:%I64i]

source: This area shows more information about files you select.
sq: Kjo zonë tregon më shumë informacion për skedën e zgjedhur.

source: One source is available (%s).
sq: Ka një burim të vlefshëm (%s).

source: %i sources are available (%s).
sq: Ka %i burime të vlefshme (%s).

source: There is one review.
sq: Ka një pasqyrë.

source: There are %i reviews.
sq: Ka %i pasqyra.

source: %s writes:
sq: %s shkruan:

source: %s rates this file:
sq: %s vlerëson:

source: Click to Preview
sq: Kliko të Parashikosh

source: Previewing...
sq: Parashikim...

source: Unable to download preview content from "%s".
sq: E pamundur të shkarkohet përmbajtja e parashikimit nga "%s".

source: Click here to search again
sq: Kliko që të kërkosh përsëri

source: No searches have been started in this window yet.
sq: Në këtë dritare nuk kryhen kërkime.

source: Shareaza is searching the network...
sq: Shareaza kërkon në rrjet...

source: The network has not returned any matches yet.
sq: Rrjeti ende nuk kthen përgjigje.

source: Some results are available, but were filtered out.
sq: Disa rezultate u gjetën, por u filtruan.

source: Shareaza is actively searching the network...
sq: Shareaza kërkon me ngulm në rrjet...

source: You are about to start a new search. Would you like to clear the results of your previous search?
sq: Nis një kërkim i ri. Do pastroni më parë rezultatet e kërkimit?

source: No Metadata
sq: Pa Metadata

source: Plain Text Search
sq: Kërkim Teksti të Thjeshtë

source: No Schema Columns
sq: Pa Skema Kolone

source: Show the Search Panel
sq: Tregon panelin e kërkimeve

source: Hide the Search Panel
sq: Fsheh panelin e kërkimeve

source: Searching
sq: Kërkim...

source: More
sq: Akoma

source: Any File Type
sq: Çdolloj Skede

source: Type your search here:
sq: Shkruaj kërkimin:

source: Look for this type of file:
sq: Për këtë lloj skede:

source: Searching:
sq: Kërkim:

source: Found:
sq: Gjetur:

source: %lu hubs, %lu leaves
sq: %lu nyja, %lu gjethe

source: Not currently searching
sq: Aktualisht nuk ka kërkim

source: No files found
sq: Nuk gjendet asnjë skedë

source: %lu file in %lu hit|%lu file in %lu hits|%lu files in %lu hits
sq: %lu skedë në %lu hit|%lu skedë në %lu hite|%lu skeda %lu hite

source: Results
sq: Rezultate

source: Advanced
sq: Avancuar

source: Establishing a connection to host...
sq: Vendoset lidhje me hostin...

source: Sent a push request, waiting for connection...
sq: Dërgohet një kërkesë shtytëse, në pritje të lidhjes...

source: Connected, requesting browse...
sq: I lidhur, kërkohet shfletimi...

source: Downloading browse response (%2.f%%)...
sq: Shkarkim i përgjigjes së shfletimit (%2.f%%)...

source: Unable to connect to host to browse user.
sq: E pamundur të ketë lidhje te hosti për shfletim përdoruesi.

source: Unable to download file listing. This host may not support browsing.
sq: E pamundur të shkarkohet lista e skedave. Ky host mbase nuk e përkrah shfletimin.

source: Search on this network:
sq: Kërko në këtë rrjet:

source: All Networks
sq: Tërë Rrjetin

source: Search Shareaza
sq: Kërko te Shareaza

source: Type some keywords to search for:
sq: Shkruaj fjalët kyçe që kërkon:

source: What type of file is it?
sq: Çfarë lloj skede është?

source: (Clear Search History)
sq: (Pastro Historinë Kërkimore)

source: File size must be
sq: Masa e skedës të jetë nga

source: Shareaza is creating hashes for %Iu file(s):
sq: Shareaza krijon hashe për %Iu skeda:

source: %i days and %i hours
sq: %i ditë dhe %i orë

source: Shareaza is downloading:
sq: Shareaza shkarkon:

source: This download is paused:
sq: Kjo shkarkesë pushon:

source: Shareaza has completed downloading:
sq: Shareaza përfundoi shkarkimin:

source: %i hours and %i minutes
sq: %i orë e %i minuta

source: %i minutes and %i seconds
sq: %i minuta e %i sekonda

source: %i seconds
sq: %i sekonda

source: Shareaza is looking for sources for:
sq: Shareaza gjen burime për:

source: No sources
sq: Asnjë burim

source: Open
sq: Hape

source: Preview
sq: Parashiko

source: Total transfer speed:
sq: Shpejtësi e transferimit:

source: Estimated time remaining:
sq: Koha e mbetur:

source: Volume downloaded:
sq: Vëllimi i shkarkuar:

source: Number of sources:
sq: Numri i burimeve:

source: Completed
sq: Përfundon

source: Shareaza is moving the download:
sq: Shareaza lëviz shkarkesën:

source: Shareaza is checking the download for errors:
sq: Shareaza verifikon shkarkesën për gabime:

source: Number of reviews:
sq: Numri i vlerësimeve:

source: Exploring Your Shareaza Library
sq: Eksplorim i Librarisë Tuaj te Shareaza

source: Exploring
sq: Eksplorim i

source: Exploring the contents of %i folders
sq: Eksplorim i përmbajtjeve të %i dosjeve

source: Multiple folders
sq: Dosje Shumëfishe

source: %i files selected
sq: Janë zgjedhur %i skeda

source: No files are selected
sq: Nuk zgjodhe asnjë skedë

source: Recent Additions
sq: Shtesat e Fundit

source: Rate this file
sq: Vlerëso Skedën

source: Type
sq: Lloji

source: Size
sq: Masa

source: Partial Source (%.2f%% available)
sq: Burime të Pjesshme (%.2f%% me vlerë)

source: %i upload slots, %i waiting in queue
sq: %i vrima ngarkimi, %i presin në radhë

source: You already have this file in your library.
sq: Kjo skedë ekziston që më parë në librari.

source: You already have this file on your download list.
sq: Kjo skedë ekziston që më parë në listën e shkarkimit.

source: This file appears to be spam.
sq: Kjo skedë duket si spam.

source: You have downloaded and deleted this file before.
sq: Këtë skedë e ke shkarkuar e fshirë më parë.

source: Blacklisted:
sq: Në Listën e Zezë:

source: Hits
sq: Hite

source: %lu today, %lu total
sq: %lu sot, %lu në total

source: No Hashset
sq: Pa Hashset

source: Status:
sq: Statusi:

source: URL:
sq: URLi:

source: User Agent:
sq: Agjenti Përd.:

source: Inactive
sq: Joaktiv

source: Active
sq: Aktiv

source: Next in Line
sq: Tjetri në Rresht

source: Total Files:
sq: Skeda Totale:

source: Total Volume:
sq: Vëllimi Total:

source: of your library
sq: i librarisë tënde

source: Folder
sq: Dosja

source: This source is currently busy
sq: Ky server është aktualisht i zënë

source: This source is firewalled
sq: Ky burim ka fajruoll

source: This source may be unstable
sq: Ky burim mund të jetë i paqëndrueshëm

source: Sources for this file are currently busy
sq: Tani janë zënë burimet për këtë skedë

source: Sources for this file are firewalled
sq: Burimet për këtë skedë kanë fajruoll

source: Sources for this file may be unstable
sq: Burimet për këtë skedë mund të jenë të paqëndrueshme

source: Untrusted
sq: I pasigurt

source: Are you sure you want to delete the selected security rules? This cannot be undone.
sq: Je i sigurt për fshirjen e rregullave të zgjedhur të sigurisë? Kjo nuk mund të kthehet.

source: Files shared over the Internet
sq: Skedat që shpërndahen në Internet

source: UPnP port mapping failed after 10 attempts.
sq: Përcjellja UPnP e portit dështoi pas 10 orvatjesh.

source: Starting Shareaza network core...
sq: Nis bërthama e rrjetit Shareaza...

source: Can't bind to %s port %i for incoming connections. Incoming connections will not be supported.
sq: Nuk mund të ketë varje te porti %s për %i lidhje të hyra. Lidhjet e hyra nuk do të përkrahen.

source: Shutting down Shareaza network core...
sq: Mbyllet bërthama e rrjetit Shareaza...

source: Disconnected from the network.
sq: U shkëpute nga rrjeti.

source: Accepting incoming TCP connections on %s port %i.
sq: Pranim i lidhjeve të hyra TCP në %s porti %i.

source: Outgoing connections will be from %s port %i.
sq: Lidhjet dalëse do të jenë nga %s porti %i.

source: Can't resolve %s for outgoing connections. Outgoing connections will use the default interface.
sq: Nuk mund të zgjidhet %s për lidhjet dalëse. Lidhjet dalëse do të përdorin ndërfaqen tipike.

source: Firewalled, not listening for incoming connections.
sq: Me fajruoll, nuk dëgjohen lidhjet e hyra.

source: Listening for UDP datagrams on %s port %i.
sq: Dëgjohen diagramat UDP në %s porti %i.

source: Resolving host "%s"...
sq: Zgjidhet hosti "%s"...

source: Unable to resolve host "%s".
sq: E Pamundur të zgjidhet hosti "%s".

source: Security manager denied connection from %s.
sq: Manaxheri i sigurisë mohon lidhjen nga %s.

source: Security manager barred a connection to %s.
sq: Menaxheri i sigurisë ndau një lidhje tek %s.

source: The address %s is already blocked by your security rules.
sq: Adresa %s bllokohet që më parë për rregulla sigurie.

source: Added a security rule to block %s.
sq: Shtim i një rregulli sigurie për bllokimin e %s.

source: Are you sure you want to disconnect?
sq: Je i sigurt se do të shkëputesh?

source: Sending query for "%s" to %s.
sq: Dërgim i hetimit për "%s" te %s.

source: Forcing your PC into hub mode may have adverse effects on performance and the P2P network. It is generally better to allow Shareaza to decide whether or not hub mode should be used.\n\nHub mode does NOT produce better search results, or have any other advantages for you.\n\nDo you really want to do this, despite these disadvantages?
sq: Detyrimi i kompjuterit tënd drejt mënyrës Nyjë mund të ketë pasoja të kundërta në efektshmërinë dhe rrjetin P2P. Është më e sigurt nëse Shareaza vendos a duhet përdorur mënyra Nyjë.\n\nMënyra Nyjë NUK jep rezultate kërkimi më të mira ose nuk ka ndonjë avantazh tjetër.\n\nVërtet do e bësh këtë, pavarësisht disavantazheve?

source: Gnutella2 is Shareaza's premiere network. Disabling support for it may severely limit both the number and quality of your search results. Are you SURE you want to do this?
sq: Gnutella2 është rrjeti parësor i Shareaza-s. Nëse nuk e lejon përkrahjen e tij, numri dhe cilësia e rezultateve të kërkimit mund të kufizohet mjaft. Je i SIGURT për këtë?

source: Your outgoing bandwidth is too low to enable this network
sq: Shtrirja dalëse e bandës tënde është tepër e vogël për lejimin e këtij rrjeti

source: Accepted an incoming connection from %s port %i.
sq: Pranohet një lidhje hyrëse nga %s porti %i.

source: Initiating a neighbour connection to %s port %i...
sq: Nis një lidhje fqinje te %s porti %i...

source: Unable to initiate a neighbour connection with %s.
sq: E pamundur të nis një lidhje fqinje me %s.

source: Timed out connecting to %s.
sq: Jashtë kohe gjatë lidhjes te %s.

source: Closing connection to neighbour %s due to lack of traffic.
sq: Lidhja te fqinji %s mbyllet për shkak të mungesës së trafikut.

source: Established a connection with neighbour %s, handshaking...
sq: Vendoset një lidhje me fqinjin %s, takohen duart...

source: Closed connection with neighbour %s.
sq: Mbyllet lidhja me fqinjin %s.

source: Unable to initiate a neighbour connection with %s (refused).
sq: E pamundur të nis një lidhje fqinje me %s (refuzim).

source: Neighbour %s dropped the connection unexpectedly.
sq: Fqinji %s ndërpret lidhjen papritur.

source: Refusing duplicate connection from %s.
sq: Refuzohet një lidhje dyfishe nga %s.

source: Already connected to %s, will not establish a second connection.
sq: I lidhur që më parë te %s, nuk do kryhet një lidhje e dytë.

source: Neighbour %s closed connection (%i : %s).
sq: Fqinji %s mbyll lidhjen (%i : %s).

source: Closed connection with neighbour %s because it is not a hub.
sq: Mbyllet lidhja me fqinjin %s sepse nuk është nyjë.

source: Timed out handshaking with %s.
sq: Jashtë kohe gjatë takimit të duarve me %s.

source: Gnutella connection with neighbour %s established successfully (G%i.%i : %s).
sq: Lidhja Gnutella me fqinjin %s kryhet me sukses (G%i.%i : %s).

source: Handshake with %s failed due to invalid data on the wire.
sq: Takimi i duarve me %s dështon për shkak të dhënave invalide në fill.

source: Closing surplus connection from %s with host hint (%s port %i).
sq: Mbyllet lidhja tepricë nga %s me këshillë hosti (%s porti %i).

source: Connection to %s rejected (%s).
sq: Lidhja te %s mohohet (%s).

source: Closing surplus connection from %s.
sq: Mbyllet lidhja tepricë nga %s.

source: Refusing connection from %s because this is a shielded leaf node.
sq: Refuzohet lidhja nga %s sepse është një gjethe nyjë me mburojë.

source: Hub neighbour %s won't accept us as a hub, closing connection.
sq: Fqinji nyjë %s nuk na pranon si nyjë, mbyllje e lidhjes.
