Repository: quazaa-development-team/Shareaza
Catalog: trunk/Languages/default-*.po
Languages: sq

source: We hope you have enjoyed using Shareaza so far. We believe it is the best file sharing application around.
sq: Shpresojmë që deri tani të jeni kënaqur duke përdorur Shareaza-n. Ne besojmë se ky është aplikimi skedë-shpërndarës më i mirë përqark.

source: Unfortunately, a lot of file sharers don't know what they're missing!
sq: Për fat të keq, shumë nga shpërdarësit e skedave nuk e dinë sa shumë u nevojitet!

source: If you know someone who would like Shareaza, whether they're a new user or someone still putting up with an inferior product, why not let them know there is a better alternative?
sq: Nëse njihni ndokënd që mund t'i pëlqente Shareaza, qoftë një përdorues i ri apo dikush që vendos të marrë një produkt me çmim të ulët, pse të mos i tregoni se ka një alternativë më të mirë?

source: Chances are they'll be grateful you rescued them!
sq: Ka shanse t'ju jenë mirënjohës që i shpëtuat!

source: Existing File
sq: Skedë Ekzistuese

source: Show me the file in my library
sq: Më trego skedën në librarinë time

source: Download the file again
sq: Shkarko skedën përsëri

source: Don't download this file
sq: Mos e shkarko skedën

source: You already have this file in your file library. What would you like to do?
sq: Kjo skedë ndodhet që më parë në librarinë tënde të skedave. Çfarë mendon të bësh?

source: You have downloaded and deleted this file before. What would you like to do?
sq: Këtë skedë e ke shkarkuar dhe e ke fshirë më parë. Çfarë mendon të bësh?

source: Warning!!! Duplicate files detected. Some malicious software may infect your Library. Make sure that you downloaded this file or placed it manually. Otherwise, shutdown Shareaza and scan your computer with an antivirus program.
sq: Kujdes!!! Diktohet një skedë dyfishe. Një softuer keqbërës mund të infektojë Librarinë tënde. Sigurohu që këtë skedë e ke shkarkuar dhe vendosur vetë. Përndryshe, mbylle Shareaza-n dhe skano kompjuterin me një antivirus.

source: Close Button
sq: Butoni i Mbylljes

source: This is the first time you have clicked Shareaza's close button. Please choose what action you would like Shareaza to take when clicking the close button from now on:
sq: Kjo është hera e parë që klikon butonin e mbylljes në Shareaza. Të lutem zgjidhe si të sillet Shareaza kur e bën këtë tani e tutje:

source: Minimise to the tray area
sq: Minimizohu në brez

source: Shut down Shareaza immediately
sq: Fike Shareaza-n menjëherë

source: Shut down Shareaza after any downloads and uploads finish
sq: Fike Shareaza-n kur çdo shkarkim/ngarkim të përfundojë

source: Download Server.met File
sq: Shkarkoni Skedën Server.met

source: You can download an eDonkey server.met file from the web to refresh your local list of servers.
sq: Skeda server.met e eDonkey mund të shkarkohet nga ky rrjet për të rifreskuar listën lokale me servera.

source: Are you sure that you want to delete:
sq: Je i sigurt për fshirjen e:

source: Delete All
sq: Fshije Gjith.

source: Shareaza can remember this file and warn you if you come across it again in another search. It will create a ghost file with your comments and rating.
sq: Shareaza mund ta mbajë mend këtë skedë dhe të lajmërojë nëse haset përsëri në një tjetër kërkim. Ajo krijon një skedë fantazmë me komentet dhe vlerësimin tuaj.

source: Create a ghost file
sq: Krijo një skedë fantazmë

source: The reason for deleting:
sq: Arsyeja e fshirjes:

source: Just deleting, keep my comments|This file is named incorrectly, and could be misleading|This file is of very poor quality|This file is a fake, or is corrupt or somehow unusable|Replace my comments with the new ones
sq: Thjesht po e fshij, mbaji komentet|Kjo skedë është emërtuar jokorrekt, dhe mund të jetë keqprijëse|Kjo skedë ka cilësi shumë të dobët|Kjo skedë është false ose e korruptuar, apo disi e papërdorshme|Zëvendëso komentet e mia me të rejat

source: File rating:
sq: Vlerësimi i skedës:

source: You can type a short note describing why you are deleting the file:
sq: Shkruaj një shënim të shkurtër që të përshkruajë pse kjo skedë po fshihet:

source: Collection Export
sq: Eksportim i Koleksionit

source: This feature is used to export the contents of a folder or playlist as a rich collection file. Please select a template and press Next to continue.|Customize your collection by entering data below.
sq: Kjo veçori përdoret për të eksportuar përmbajtjet e një dosjeje ose liste si një skedë me koleksion të pasur. Të lutem zgjidhe një tempujkë dhe shtype Vijo për të vijuar.|Porosite koleksionin tënd duke futur të dhëna më poshtë.

source: Template Information:
sq: Informacioni i Tempujkës:

source: Delete|_Back
sq: Fshije|_Pas

source: _Next|_Export...
sq: _Vijo|Eksporto...

source: _Cancel
sq: _Anulo

source: WARNING: This dialog provides advanced download editing features for power users which if used incorrectly can and probably will cause corruption.
sq: KUJDES: Kjo tabelë paraqet veçori të avancuara për editimin e shkarkimit, të cilat, nëse përdoren jo korrekt, mundet e mbase do të shkaktojnë korruptim.

source: Filename and Si_ze:
sq: Emri dhe _Masa e skedës:

source: File size (Byte):
sq: Masa e skedës (Bajte):

source: _URNs:
sq: _URNe:

source: Trusted
sq: I sigurt

source: Forget current verification status and reverify
sq: Harro statusin aktual të verifikimit dhe riverifiko

source: Assume file is 100% complete and reverify
sq: Supozo që skeda ka përfunduar 100% dhe riverifiko

source: Forget all known sources
sq: Harro tërë burimet e njohura

source: Merge with local file and verify
sq: Bashkoje me skedën lokale dhe riverifiko

source: Cancel download but save incomplete file(s)
sq: Anulo shkarkimin por ruaj skedat e papërfunduara:

source: Erase
sq: Fshije

source: _Actions:
sq: _Veprime:

source: Data _Eraser:
sq: Fshirësi i të _Dhënave:

source: Byte range:
sq: Caku i bajtit:

source: to
sq: te

source: Open Torrent File
sq: Hapeni Skedën Torrent

source: You have opened a BitTorrent torrent file. Would you like to download its contents, or re-seed it?
sq: Ke hapur një skedë torrent në BitTorrent. Do i shkarkosh përmbajtjet e saj, apo do e rimbjellësh?

source: Seed
sq: Mbille

source: To share complete files using BitTorrent they must first be seeded. Once this process is complete the Torrent will appear as a new item in your download list.
sq: Për të shpërndarë skeda të plota me BitTorrent ato në fillim duhet të mbillen. Sapo ky proces të përfundojë Torrent-i do të shfaqet si një njësi e re në listën tënde të shkarkimeve.

source: As needed| When ratio over 100%| Only when requested| Never
sq: Siç nevojitet| Kur raporti është mbi 100%| Vetëm kur kërkohet| Kurrë

source: Torrent _Information:
sq: _Informacioni i Torrentit:

source: By:
sq: Nga:

source: Comments:
sq: Komente:

source: Transfers:
sq: Transferta:

source: Start new download transfers:
sq: Nis transferimin e ri të shkarkesës:

source: Total Uploaded:
sq: Ngarkimi Total:

source: Notes:
sq: Shënime:

source: Trackers
sq: Gjurmues

source: Disabled|Single Tracker|Multi-tracker|Multi-tracker (locked)
sq: E çaktivizuar|Gjurmues i Vetëm|Multi-gjurmues|Multi-gjurmues (i kyçur)

source: Tracker:
sq: Gjurmuesi:

source: _Current Tracker:
sq: Gjurmuesi _Aktual:

source: Completed (Seeds):
sq: Përfunduar (Fara):

source: Incomplete:
sq: Pa përfunduar:

source: Tracker Mode:
sq: Mënyra e Gjurmuesit:

source: Download Group Properties
sq: Vetitë e Grupit të Shkarkimit

source: _BitTorrent downloads
sq: Shkarkesat _BitTorrent

source: _Filters:
sq: _Filtra:

source: _Completed File Folder:
sq: _Dosja e Skedave të Përfunduara:

source: _Type of file:
sq: _Lloji i skedës:

source: Select Visualisation
sq: Zgjidheni Vegimin

source: Select an audio visualisation from the list:
sq: Zgjidhe një vegim zanor nga lista:

source: Footer Display|Full Size Display|Large Display|Medium Display|Small Display
sq: Shfaqe në Fund|Shfaqe me Masë të Plotë|Shfaqe të Madh|Shfaqe të Mesëm|Shfaqe të Vogël

source: Upgrade Alert
sq: Alarmi i Përmirësimit

source: A new version of Shareaza is now available. Would you like to upgrade?
sq: Për Shareaza-n ka dalë një version i ri. Do e përmirësoni?

source: If you select Upgrade Now, Shareaza will add the upgrade to your download queue and automatically begin downloading it.
sq: Nëse zgjidhet Përmirëso Tani, Shareaza do e shtojë përmirësimin në radhën tuaj të punëve për shkarkim dhe do nisë ta shkarkojë atë automatikisht.

source: _Upgrade Now
sq: _Përmirëso Tani

source: Don't check for new versions
sq: Mos verifiko versionet e reja

source: Don't Upgrade
sq: Mos Përmirëso

source: Download Reviews
sq: Vlerësimet e Shkarkesës

source: Metadata Localisation
sq: Lokalizimi i Metadatave

source: Please select the method of re-encoding:
sq: Të lutem zgjidhe metodën e rikodimit

source: Arabic|Baltic|Central European|Chinese Simplified|Chinese Traditional|Cyrillic|Greek|Hebrew|Japanese|Korean|Thai|Turkish|Vietnamese
sq: Arab|Baltik|Europa Qendrore|Kinez i thjeshtë|Kinez tradicional|Cirilik|Grek|Hebre|Japonez|Korean|Tailandez|Turk|Vietnamez

source: Preview:
sq: Parashiko:

source: Channel Name|Why reason
sq: Emri i Kanalit|Arsyeja pse

source: Enter channel you want to add:|Enter kick/ban reason:
sq: Shkruaj kanalin që do të shtosh:|Shkruaj arsyen e gjuajtjes/dëbimit:

source: Action
sq: Veprimi

source: Bandwidth
sq: Gjerësi e bandës

source: File
sq: Skeda

source: Extension
sq: Shtojca

source: Modified
sq: Modifikimi

source: DownloadedFile
sq: Skeda e Shkarkuar

source: Progress
sq: Progresi

source: Status
sq: Statusi

source: Client
sq: Klienti

source: Downloaded
sq: Shkarkuar

source: Complete
sq: Përfunduar

source: Country
sq: Vendi

source: RemoteUser
sq: Përdoruesi në Largësi

source: UploadedFile
sq: Skeda e Ngarkuar

source: Address
sq: Adresa

source: Port
sq: Porti

source: Time
sq: Ora

source: Packets
sq: Paketa

source: Total
sq: Totali

source: Flow
sq: Rrjedha

source: Leaves
sq: Gjethe

source: Mode
sq: Mënyra

source: Address/Content
sq: Adresa / Përmbajtje

source: Expires
sq: Skadimi

source: Precedence
sq: Paraprirje

source: Comment
sq: Komenti

source: LastSeen
sq: Parë së Fundmi

source: DailyUptime
sq: Zgjimi Ditor

source: Description
sq: Përshkrimi

source: CurUsers
sq: PërdorAktualë

source: MaxUsers
sq: PërdoruesMaks

source: Failures
sq: Dështime

source: LastAccess
sq: Hyrje e Fundit

source: Hosts
sq: Hoste

source: Accesses
sq: Aksese

source: Updates
sq: Ridatime

source: Protocol
sq: Protokolli

source: Schema
sq: Skema

source: Host/Count
sq: Hosti/Numërimi

source: Criteria
sq: Kriteri

source: Transfers
sq: Transferta

source: Order
sq: Rendi

source: Setting
sq: Vendosje

source: Value
sq: Vlera

source: Filename
sq: Emri i skedës

source: Tracker
sq: Gjurmuesi

source: User
sq: Përdoruesi

source: Comments
sq: Komente
