Repository: quazaa-development-team/Shareaza
Catalog: trunk/Languages/default-*.po
Languages: sq

source: Connecting neighbour %s falling back to shielded leaf mode.
sq: Fqinji në lidhje %s kthehet pas në gjethe nyjë me mburojë.

source: Hub connection established, closing peer connections.
sq: Vendoset lidhja nyjë, mbyllje e lidhjes së pikës.

source: Acting as a hub for leaf neighbour %s.
sq: Veprim si nyjë për fqinjin gjethe %s.

source: Neighbour %s wants to be a hub, closing connection.
sq: Fqinji %s do të jetë nyjë, mbyllje e lidhjes.

source: Neighbour %s is not a hub, closing connection.
sq: Fqinji %s nuk është nyjë, mbyllje e lidhjes.

source: Gnutella2 connection with neighbour %s established successfully (%s).
sq: Lidhja Gnutella2 me fqinjin %s u vendos me sukses (%s).

source: Closing connection to non-Gnutella2 neighbour %s.
sq: Mbyllet lidhja me fqinjin jo-Gnutella2 %s.

source: Neighbour %s forwarded a packet of excessive size, dropping connection.
sq: Fqinji %s përcolli një paketë me masë të tepërt, lëshim i lidhjes.

source: Neighbour %s forwarded a packet with zero TTL, ignoring.
sq: Fqinji %s përcolli një paketë TTL zero, përbuzje.

source: Neighbour %s forwarded a packet with excessive TTL, dropping packet (TTL=%i, Hops=%i).
sq: Fqinji %s përcolli një paketë me TTL të tepërt, lëshim i paketës (TTL=%i, Hops=%i).

source: Neighbour %s forwarded a ping packet with invalid length, ignoring.
sq: Fqinji %s përcolli një paketë ping me gjatësi invalide, përbuzje.

source: Neighbour %s forwarded a pong packet with invalid length, ignoring.
sq: Fqinji %s përcolli një paketë pong me gjatësi invalide, përbuzje.

source: Leaf neighbour %s is forwarding queries, dropping connection.
sq: Fqinji gjethe %s përcjell hetime, lëshim i lidhjes.

source: Neighbour %s forwarded an unrecognised packet (0x%.2x), ignoring.
sq: Fqinji %s përcolli një paketë të panjohur (0x%.2x), përbuzje.

source: Neighbour %s forwarded a pong with invalid address data, ignoring.
sq: Fqinji %s përcolli një pong me të dhëna adrese invalide, përbuzje.

source: Are you sure you want to clear "%s"?\n\nOnce a download has been cleared from the Downloads window, it cannot be resumed later.
sq: Je i sigurt për pastrimin e "%s"?\n\nKur një shkarkesë pastrohet nga dritarja e Shkarkesave, ajo nuk mund të rimerret më.

source: Aborting download of "%s" from %s (%s), network disabled.
sq: Ndërpritet shkarkimi i "%s" nga %s (%s), çaktivizim i rrjetit.

source: You're not connected to the network.
sq: Nuk je i lidhur në rrjet.

source: Click the Connect button to get started.
sq: Shtype butonin Lidhu që të nisësh.

source: Show All File Types
sq: Trego Tërë Llojet e Skedave

source: Copy &URI
sq: Kopjo &URIn

source: Export &URIs...
sq: Eksporto &URIt...

source: Ghost File
sq: Skeda Fantazmë

source: New Group
sq: Grup i Ri

source: Host:
sq: Hosti:

source: Port:
sq: Porti:

source: &Connect
sq: &Lidhu

source: &Browse
sq: &Shfleto

source: Add
sq: Shto

source: Filename:
sq: Emri i skedës:

source: Type:
sq: Lloji:

source: Unspecified
sq: I pacaktuar

source: (No Visualisation)
sq: (Asnjë vegim)

source: You have not yet specified a connection speed. Before continuing, please either choose your Internet connection type, or type in a connection speed.
sq: Nuk e ke përcaktuar shpejtësinë e lidhjes. Përpara se të vijosh, të lutem zgjidhe llojin e lidhjes tënde me Internetin, ose shkruaj shpejtësinë e lidhjes.

source: You have not specified any folders to share. Are you sure?
sq: Nuk ke përcaktuar asnjë dosje për ta shpërndarë. Je i sigurt?

source: The folder you are sharing is already shared as part of another shared folder:\n\n%s
sq: Dosja që shpërndani shpërndahet që më parë si pjesë e një tjetër dosje të shpërndarë:\n\n%s

source: You haven't entered a screen name in your user profile.
sq: Në profilin e përdoruesit nuk keni shkruar asnjë emër.

source: You haven't entered your location in your user profile.\n\nIt's a good idea to enter your location so that other users can see which country you are from. Note that entering a location does not reveal any compromising information.\n\nAre you sure you want to continue without entering your location?
sq: Në profilin e përdoruesit nuk keni shkruar vendin tuaj.\n\nËshtë mirë që ta shkruani atë që përdoruesit e tjerë ta shohin se nga cili vend jeni. Vëreni se hyrja e vendit nuk zbulon ndonjë informacion me rrezik.\n\nJe i sigurt se do të vijosh pa shkruar vendin nga je?

source: E&xit
sq: D&alje

source: year old
sq: vjeç

source: Automatic
sq: Automatike

source: Querying host discovery services...
sq: Hetohen shërbimet zbuluese të hostit...

source: Querying discovery service "%s"...
sq: Hetohet shërbimi zbulues "%s"...

source: Browsing %s
sq: Shfletim %s

source: Found %i shared files in %s's library.
sq: U gjetën %i skeda të shpërndara në librarinë e %s.

source: Shareaza Media Player
sq: MediaLuajtësi i Shareaza-s

source: Unable to load media file "%s"
sq: Nuk mund të ngarkohet kjo skedë mediatike "%s"

source: There is no file playing. Double-click a media file in your library to play it.
sq: Nuk ka skedë në lojë. Që të luash një skedë nga libraria jote, kliko dy herë mbi të.

source: P L A Y L I S T
sq: L I S T A

source: Send:
sq: Dërgo:

source: Welcome to Shareaza Chat!
sq: Mirë se erdhe te Chat-i i Shareaza-s!

source: Please respect others while using this service
sq: Të lutem respekto të tjerët kur e përdor këtë shërbim

source: Users
sq: Përdorues

source: Channels
sq: Kanale

source: Initiating a connection to %s...
sq: Nis një lidhje te %s...

source: Unable to create a connection to %s.
sq: E pamundur të krijohet një lidhje te %s.

source: Connection closed.
sq: Lidhje e mbyllur.

source: BitTorrent connection to %s was dropped.
sq: Lidhja BitTorrent me %s u këput.

source: BitTorrent handshake with %s was dropped.
sq: Takimi i dorës BitTorrent me %s u këput.

source: BitTorrent coupling with %s was dropped.
sq: BitTorrent coupling with %s u këput.

source: BitTorrent coupling with %s not accepted, a connection to this client already exists.
sq: Çiftëzimi BitTorrent me %s nuk u pranua, lidhja me këtë klient ekziston që më parë.

source: BitTorrent coupling with %s not accepted, maximum connections reached.
sq: Çiftëzimi BitTorrent me %s nuk u pranua, u arritën lidhjet maksimale.

source: Private torrent
sq: Torrent privat

source: Encoding error
sq: Gabim kodimi

source: Updating Bittorrent Downloads...
sq: Ridatim i Shkarkesave Bittorrent...

source: Converting Torrent:
sq: Konvertim i Torrentit:

source: Download File or Torrent
sq: Shkarkoni Skedë ose Torrent

source: You have made changes to the name field. Are you sure you want to rename this download?
sq: Kryet ndryshime te fusha e emrit. Je i sigurt për riemërtimin e shkarkesës?

source: Are you sure you want to forget the current verification status? All downloaded data will be treated as untrusted, and cached hashtrees and hashsets will be flushed.
sq: Je i sigurt se do të harrosh statusin aktual të verifikimit? Tërë të dhënat e shkarkuara do të trajtohen si të pabesueshme, dhe hash-pemët e depozituara do të shpërbëhen.

source: Are you sure you want to forget all sources for the selected download?
sq: Je i sigurt se do të harrosh tërë burimet për shkarkesën e zgjedhur?

source: Please enter a valid range to erase. The "from" field is the first byte to erase, the "last" field is the last byte to erase.
sq: Të lutem shkruaj një kufi të vlefshëm për të fshirë. Fusha "nga" është bajti i parë për t'u fshirë, fusha "fundit" është bajti i fundit për t'u fshirë.

source: Unable to erase the selected range from the download because no part of the range is present.
sq: Nuk mund të fshij nga shkarkesa kufirin e zgjedhur sepse asnjë pjesë e kufirit nuk është e pranishme.

source: Erased %I64i bytes from the download.
sq: Fshiva %I64i bajte nga shkarkesa.

source: Dropping download source %s for "%s" because queue position %i is too high.
sq: Këputet burimi i shkarkesës %s për "%s" sepse pozicioni në radhë %i është mjaft i lartë.

source: You cannot assume this download is complete and reverify it because you do not yet have any partial verification data, such as tiger-tree volume, eDonkey hashset or BitTorrent hashset. Without verification information the download cannot be reverified.
sq: Nuk mund të supozoni se kjo shkarkesë ka përfunduar dhe ta riverifikoni atë, pasi nuk keni akoma ndonjë të dhënë të pjesshme verifikuese, si vëllimin tiger-tree, hashsetin eDonkey ose atë BitTorrent. Pa informacion verifikues shkarkesa nuk mund të riverifikohet.

source: Are you sure you want to assume this download is complete and reverify it? The whole file will be considered, and Shareaza will accept parts which pass verification and redownload parts which fail verification.
sq: Je i sigurt se do të supozosh se kjo shkarkesë ka përfunduar dhe do e riverifikosh atë? E tërë skeda do të merret parasysh dhe Shareaza do të pranojë pjesë të cilat e kalojnë verifikimin dhe do të rishkarkojë pjesët që nuk e kalojnë atë.

source: You have made changes to the file size. Are you sure you want to change the file size for this download?
sq: Kryet ndryshime te masa e skedës. Je i sigurt për ndryshimin e masës për këtë shkarkesë?

source: Remote access is disabled.
sq: Aksesi në largësi është çaktivizuar.

source: You must choose a username and password.
sq: Duhet të zgjidhet një emër përdoruesi dhe fjalëkalimi.

source: Unable to accept connections, URL unavailable.
sq: Nuk mund të pranoj lidhjet, URLi pa vlerë.

source: No URN available
sq: Asnjë URN me vlerë

source: of (e.g. 1 of 10)
sq: nga

source: No
sq: Jo

source: Yes
sq: Po

source: Default
sq: Tipik

source: Custom
sq: Me porosi

source: &Back
sq: &Pas

source: &Next
sq: &Tjetër

source: Finish
sq: Përfundo

source: All
sq: Gjithçka

source: Requesting
sq: Kërkesë

source: Response
sq: Përgjigje

source: Downloading
sq: Shkarkim

source: Busy
sq: I Zënë

source: Enqueue
sq: Në radhë

source: Queued
sq: Në pritje

source: Seeding
sq: Mbjellje

source: Moving
sq: Lëviz

source: Paused
sq: Pushon

source: File Error
sq: Gabim Skede

source: Can't Move
sq: Nuk Lëviz

source: Verifying
sq: Verifikim

source: Pending
sq: Varur

source: Creating
sq: Krijim

source: Torrent
sq: Torrenti

source: Tracker Down
sq: Gjurmuesi Poshtë

source: (No Sources)
sq: (Asnjë Burim)

source: Verified
sq: I verifikuar

source: Unverified
sq: I paverifikuar

source: source
sq: burim

source: sources (numbers 21, 31, ...)
sq: burime

source: sources (tens)
sq: burime

source: sources (from 11 to 19)
sq: burime

source: sources (from 2 to 4)
sq: burime

source: sources (from 5 to 9)
sq: burime

source: Uninterested
sq: I painteresuar

source: Choked
sq: I mbytur

source: sources (e.g. 3/10 sources)
sq: burime

source: (No Rating)
sq: (Pa Vlerësim)

source: Fake / Corrupt
sq: Fals / i Korruptuar

source: Poor
sq: I dobët

source: Average
sq: Mesatar

source: Good
sq: I mirë

source: Very Good
sq: Shumë i mirë

source: Excellent
sq: I shkëlqyer

source: Select the eDonkey/eMule temp folder:
sq: Zgjidhe dosjen temp të eDonkey/eMule:

source: Title
sq: Titulli

source: Length
sq: Kohëzgjatje

source: Bitrate
sq: Raporti i bitit

source: Album
sq: Albumi

source: Artist
sq: Artisti

source: Rating
sq: Vlerësimi

source: Cancel
sq: Anulo

source: Abort
sq: Ndërprite

source: Retry
sq: Riprovo

source: Ignore
sq: Përbuze

source: Try Again
sq: Provo Përsëri

source: Continue
sq: Vijo

source: &Remember my selection next time
sq: &Mbaj mend zgjedhjen time herën tjetër

source: Save Completed Files Here
sq: Depozito Këtu Skedat e Përfunduara

source: Store Temporary Incomplete Files Here
sq: Depozito Këtu Skedat Kohëshkurtër të Papërfunduara

source: Store Torrents Here
sq: Depozito Këtu Torrentet

source: Store Collections Here
sq: Depozito Këtu Koleksionet

source: Apply
sq: Zbato

source: _General:
sq: _Përgjithësi:

source: Auto-connect on Shareaza startup
sq: Autolidhu kur nis Shareaza

source: Start Shareaza at Windows startup
sq: Hape Shareaza-n kur nis Windows-i

source: Show a prompt before opening URIs
sq: Lajmëro para hapjes së URI-ve

source: Show rates in:
sq: Raporto në:

source: bits/second|bytes/second|b/s|B/s|Kb/s|KB/s|Mb/s|MB/s
sq: bajt/sekondë|bajte/sekondë|b/s|B/s|Kb/s|KB/s|Mb/s|MB/s

source: _Downloads:
sq: _Shkarkim:

source: Expand new downloads by default
sq: Zgjero automatikisht shkarkesat e reja

source: Open a download _monitor window
sq: _Monitoro shkarkimin

source: _Search:
sq: _Kërkim:

source: Expand multi-source files by default
sq: Zgjero skedat me shumë burime

source: Switch to Transfers view on download
sq: Kalo te Transferimi kur shkarkon

source: Hide side bar when starting search
sq: Fshehe shufrën anësore kur nis kërkimi

source: Filter adult content from searches
sq: Filtro përmbajtjet për të rritur

source: _Tooltips:
sq: K_ëshilla:

source: Delay (ms):
sq: Vonesa (ms):

source: Opacity:
sq: Opaciteti:

source: _Tray:
sq: _Brezi:

source: When I click close:
sq: Kur klikoj mbylle:

source: Ask Me|Close Immediately|Minimise to Tray|Close After Transfers
sq: Më Pyet|Mbylle Menjëherë|Minimizim në Brez|Mbylle Pas Transferimit

source: When I click minimise:
sq: Kur klikoj minimizo:

source: Normal|Minimise to Tray
sq: Normale|Minimizim në Brez

source: _Options:
sq: _Mundësi:

source: Remember folder views
sq: Mbaje mend pamjen e dosjes

source: Watch library folders
sq: Shiko dosjet në librari

source: Quick hashing (Uses more CPU)
sq: Grirje e shpejtë (përdor mjaft CPU)

source: Allow others to browse shares
sq: Të tjerët i shfletojnë shpërndarjet

source: _Recent Files:
sq: _Skedat e Fundit:

source: Remember:
sq: Mbaj mend:

source: files
sq: skeda

source: For up to:
sq: Deri në:

source: days
sq: ditë

source: Clear History Now
sq: Pastro Historinë Tani

source: _Safe to Open:
sq: _Hap pa Rrezik:

source: _Add
sq: _Shto

source: _Never Share:
sq: _Kurrë Mos Shpërnda:

source: Create ghost files when deleting
sq: Krijo skeda fantazmë kur fshin

source: Smart video series detection
sq: Diktim inteligjent i serive filmike

source: Use the Shareaza Media Player to PLAY the file types listed below
sq: MediaLuajtësi në Shareaza do LUAJË llojet e skedave më poshtë

source: Use the Shareaza Media Player to ENQUEUE the file types listed below
sq: MediaLuajtësi në Shareaza do vë në radhë llojet e skedave më poshtë

source: File _Types:
sq: _Lloji i Skedave:

source: Audio _Visualisation Plugin:
sq: Spinat e _Vegimit Zanor:

source: _Select Plugin...
sq: _Zgjidh Spinat...

source: _Media Handling
sq: Trajtimi i _Medias

source: Choose Media Handler:
sq: Zgjidhe Trajtimin e Medias:

source: Warning: Choosing an external Media Handler will automatically disable all Media and Visualisation Plugins!
sq: Kujdes: Nëse zgjedh një Trajtues të jashtëm të Medias do çaktivizosh automatikisht tërë Spinat e Medias dhe Vegimit!

source: My _Profile:
sq: _Profili Im:

source: You can use your Gnutella User Profile to share information about yourself, your interests and recommended files and websites with others.
sq: Profili si Përdorues i Gnutella-s mund të përdoret për të ndarë me të tjerët informacione rreth vetes, interesa dhe skeda/troje që rekomandon.

source: Enable peer to peer chat with compatible clients
sq: Lejo chat-in pikë më pikë me klientët e pajtueshëm

source: Enable chat over other protocols (where possible)
sq: Lejo chat-in në të gjitha rrjetet

source: Filter chat messages for spam
sq: Filtro mesazhet me spame

source: Censor profanity in chat
sq: Censuro blasfeminë në chat

source: Client _Options:
sq: _Mundësitë e Klientit:

source: Show chat integration
sq: Trego intregimin e chat-it

source: Flood protection:
sq: Mbrojtje nga përmbytjet:

source: lines per second
sq: vija për sekondë

source: Show timestamp
sq: Trego orën

source: Screen Font:
sq: Shkrimi i Ekranit:

source: _Colors:
sq: _Ngjyra:

source: Server messages
sq: Mesazhet e serverit

source: Topics
sq: Tema

source: Channel Actions
sq: Veprimet e Kanalit

source: Notices
sq: Lajmërime

source: Chat background
sq: Sfondi i chat-it

source: Text
sq: Tekst

source: Connection _Settings:
sq: _Vendosjet e Lidhjes:

source: Nickname:
sq: Nofka:

source: User name:
sq: Emri i përdoruesit:

source: Alternate Nickname:
sq: Nofka alternative:

source: Real name:
sq: Emri i vërtetë:

source: Server:
sq: Serveri:

source: Web
sq: Rrjet

source: _Peer to Peer Link Handling:
sq: Trajtimi i Linkeve _Pikë më Pikë:

source: Use Shareaza to open these types of links:
sq: Shareaza do të hapë këto lloje linkesh:

source: _Download Manager:
sq: Menaxheri _Shkarkues:

source: Use Shareaza to manage all my web downloads:
sq: Shareaza do të menaxhojë tërë shkarkesat e mia nga rrjeti:

source: The download manager plugin will only attempt to download file types listed here. Other file types will be handled by your web browser. Shareaza must be running to manage downloads.
sq: Spina e menaxherit shkarkues do të orvatet të shkarkojë vetëm llojet e skedave në listë. Llojet e tjera do të trajtohen nga shfletuesi yt i rrjetit. Shareaza duhet të veprojë për të menaxhuar shkarkesat.

source: _Inbound Address:
sq: Adresa _Hyrëse:

source: Address:
sq: Adresa:

source: Random
sq: Rastësor

source: Force binding to this address
sq: Forco lidhjen te kjo adresë

source: _Outbound Address:
sq: Adresa _Dalëse:

source: O_ptions:
sq: M_undësi:

source: Can accept incoming connections
sq: Prano lidhjet që vijnë

source: Ignore private/local IP addresses
sq: Përbuze adresën me IP private/lokale

source: Enable UPnP connection devices setup
sq: Lejo ndërtimin e pajisjeve lidhëse UPnP

source: _Timeouts:
sq: _Jashtë kohe:

source: Handshake:
sq: Takimi i Dorës:

source: Maximum Files:
sq: Skeda Maksimale:

source: Maximum Transfers:
sq: Transferta Maksimale:

source: Transfers per File:
sq: Transferta për Skedë:

source: Total Download Bandwidth:
sq: Banda Totale e Shkarkimit:

source: Maximum Queue Length:
sq: Gjatësi Maksimale e Radhës:

source: Only download and upload to networks which are connected.
sq: Shkarko dhe ngarko vetëm nga rrjetet e lidhura.

source: Share NEW partial downloads
sq: Shpërnda shkarkesat e REJA

source: Limit sharing in hub mode
sq: Kufizo shpërndarjen si 'nyjë'

source: Share preview files
sq: Shpërnda skedat e parashikimit

source: Limit per unique host:
sq: Kufiri për hostin unik:

source: _User-Agent Filter:
sq: _Filtri për Agjentin Përdorues:

source: _Bandwidth:
sq: _Gjerësi e Bandës:

source: Limit:
sq: Kufiri:

source: Mode:
sq: Mënyra:

source: Maximum|Average
sq: Maksimale|Mesatare

source: _Queues:
sq: _Radhë:

source: _New...
sq: E _re...

source: _Edit...
sq: _Edito...

source: (changes take effect immediately)
sq: (ndryshimet kanë efekt menjëherë)

source: Remote Access
sq: Akses në Largësi

source: _Guide:
sq: _Guida:

source: Shareaza Remote Access allows you to leave Shareaza running on your PC, and control it remotely using a web browser. You will need to be able to accept incoming connections to use this feature (i.e. properly configured router, etc).
sq: Aksesi në Largësi bën që Shareaza të veprojë në kompjuter dhe të kontrollohet me një shfletues rrjeti të jashtëm. Që kjo veçori të përdoret, duhet të jesh i aftë të pranosh lidhjet hyrëse (d.m.th. të konfigurosh ruterin si duhet etj.).

source: _Enable:
sq: _Aktivizo:

source: Enable Shareaza Remote Access:
sq: Lejo Aksesin në Largësi të Shareaza-s:

source: _Credentials:
sq: _Kredenciale:

source: Choose a Username:
sq: Zgjidhe Përdoruesin:

source: Choose a Password:
sq: Zgjidhe Fjalëkalimin:

source: Networks
sq: Rrjete

source: Shareaza is a general-purpose file-sharing application that can access many P2P networks at the same time. On this page you can select which P2P networks you want to connect to, and then adjust specific settings for each network.
sq: Shareaza është një aplikim skedëshpërndarës me synim të përgjithshëm hapjen e sa më shumë rrjeteve P2P në një kohë. Në këtë faqe mund të zgjidhen rrjetet P2P te të cilat do të lidhesh, pastaj mund të rregullosh vendosjet e caktuara për secilin rrjet.

source: Gnutella2 Network:
sq: Rrjeti Gnutella2:

source: The Gnutella2 network is Shareaza's premiere network, offering more features and performance than any other P2P net. Highly recommended.
sq: Rrjeti Gnutella2 është rrjeti parësor i Shareaza-s, i cili ofron shumë më tepër veçori dhe rendiment se çdo rrjet tjetër P2P (Rekomandohet fort)

source: Connect to Gnutella2 (G2)
sq: Lidhu tek Gnutella2 (G2)

source: Configure Gnutella2
sq: Konfiguro Gnutella2

source: eDonkey Network:
sq: Rrjeti eDonkey:

source: The eDonkey network is a popular server-based network. While not as feature-rich as Gnutella2, eDonkey has an impressive file collection.
sq: Rrjeti eDonkey është rrjeti i famshëm me bazë një server. Ndonëse nuk ka aq veçori sa Gnutella2, eDonkey ka një koleksion mahnitës me skeda.

source: Connect to eDonkey
sq: Lidhu tek eDonkey

source: Configure eDonkey
sq: Konfiguro eDonkey

source: Original Gnutella Network:
sq: Rrjeti Origjinal Gnutella:

source: Although the original Gnutella network is less feature-rich than Gnutella2, and has fewer files than eDonkey, it remains a valuable resource.
sq: Ndonëse rrjeti origjinal Gnutella ka më pak veçori se Gnutella2 dhe ka më pak skeda se eDonkey, ai mbetet një burim me vlerë.

source: Connect to Original Gnutella
sq: Lidhu tek Gnutella Origjinal

source: Configure Gnutella1
sq: Konfiguro Gnutella1

source: Always connect to Gnutella2
sq: Gjithmonë lidhu te Gnutella2

source: Connect to Gnutella2 today
sq: Lidhu sot te Gnutella2

source: Optimal|Leaf|Hub
sq: Optimale|Gjethe|Nyjë

source: Always connect to Gnutella1
sq: Gjithmonë lidhu te Gnutella1

source: Connect to Gnutella1 today
sq: Lidhu sot te Gnutella1

source: Optimal|Leaf|Ultrapeer
sq: Optimale|Gjethe|Ultrapikë

source: Hub to Leaf
sq: Nyjë në Gjethe

source: Leaf to Hub
sq: Gjethe në Nyjë

source: Hub to Hub
sq: Nyjë në Nyjë

source: Mode:
sq: Mënyra:

source: G_2 Connections:
sq: Lidhje G_2:

source: Leaf to Hub:
sq: Gjethe në Nyjë:

source: Hub to Leaf:
sq: Nyjë në Gjethe:

source: Hub to Hub:
sq: Nyjë në Nyjë:

source: Gnutella1 Network:
sq: Rrjeti Gnutella1:

source: G_1 Connections:
sq: Lidhje G_1:

source: Leaf to Ultrapeer:
sq: Nyjë në Ultrapikë:

source: Ultrapeer to Leaf:
sq: Ultrapikë në Nyjë:

source: Peer to Peer:
sq: Pikë në Pikë:

source: _Link Compression:
sq: Ngjeshje e _Linkut:

source: Always connect to eDonkey
sq: Lidhu përherë te eDonkey

source: Connect to eDonkey today
sq: Lidhu sot te eDonkey

source: Search known remote servers in the server cache:
sq: Kërko serverat e njohur të largët në depon e serverave:

source: Receive and update server list from the connected server
sq: Merre dhe ridato server-listën nga serveri i lidhur

source: Download...
sq: Shkarko...

source: _eDonkey Network:
sq: Rrjeti _eDonkey:

source: _Global Searching:
sq: Kërkim _Global:

source: Stop searching after:
sq: Ndale kërkimin pas:

source: search results.
sq: rezultate kërkimi.

source: _Client Link Connections:
sq: Linku i Lidhjeve të _Klientit:

source: Connect to no more than:
sq: Mos u lidh te më tepër se:

source: other eDonkey clients.
sq: klientë të tjerë në eDonkey.

source: eDonkey _Tools:
sq: _Mjetet e eDonkey:

source: Download eDonkey server list from the web:
sq: Shkarko server-listën e eDonkey në rrjet:

source: Clear downloaded torrents When the share ratio reaches:
sq: Pastro torrentin e shkarkuar Kur raporti i shpërndarjes arrin:

source: Prefer torrent sources
sq: Pëlqe burimet e torrentit

source: Enable EndGame mode when completing torrents
sq: Lejo mënyrën FundLojë kur përfundon torrenti

source: _Download Connections:
sq: Lidhjet e _Shkarkimit:

source: Torrents at once
sq: Torrente përnjëherë

source: Client connections
sq: Lidhje me klientë

source: Default Tracker:
sq: Gjurmuesi Tipik:

source: _Torrent Creator:
sq: Krijuesi i _Torrenteve
