Repository: quazaa-development-team/Shareaza
Catalog: trunk/Languages/default-*.po
Languages: sq

source: (translation language: English)
sq: Shqip

source: (translation author)
sq: Besmir Godole

source: (translation updaters)
sq: Besmir Godole

source: (translation description: Shareaza English Skin File)
sq: Shareaza Default Albanian Skin File

source: (translation URL: http://shareaza.sourceforge.net/)
sq: http://shareaza.sourceforge.net/

source: (author e-mail)
sq: bgodole(at)gmail.com

source: (translation language code: en)
sq: sq

source: (translation prompt: Click here to select English as your natural language.)
sq: Kliko këtu që të zgjedhësh shqipen si gjuhë tipike.

source: (translation language direction: ltr or rtl)
sq: ltr

source: Connect
sq: Lidhu

source: Home
sq: Shtëpi

source: Library
sq: Librari

source: Media Player
sq: MediaLuajtës

source: Search
sq: Kërko

source: Downloads
sq: Shkarkim

source: Network
sq: Rrjet

source: New Search
sq: Kërkim i Ri

source: Download
sq: Shkarko

source: Browse User
sq: Shfleto Përdoruesin

source: Show Search
sq: Trego Kërkimin

source: Show Details
sq: Trego Detaje

source: Filter:
sq: Filtër:

source: Type some words to filter the results with
sq: Shkruani disa fjalë për filtrimin e rezultateve

source: More...
sq: Më shumë...

source: Search Again...
sq: Kërko Prapë...

source: Stop Search
sq: Ndale Kërkimin

source: Profile
sq: Profili

source: Shared Files
sq: Skedat e Shpërndara

source: Folders
sq: Dosje

source: Organiser
sq: Organizuesi

source: Chat to User
sq: Bisedo me Përdoruesin

source: Stop
sq: Ndalo

source: Refresh
sq: Rifresko

source: Open or Play
sq: Hape ose Luaje

source: Preview File
sq: Parashiko Skedën

source: Delete File
sq: Fshije Skedën

source: Resume Download
sq: Rimerre Shkarkimin

source: Pause Download
sq: Pusho Shkarkimin

source: Cancel Download
sq: Anulo Shkarkimin

source: Clear Download
sq: Pastro Shkarkimin

source: Show Monitor
sq: Trego Monitorin

source: Add Download/Torrent...
sq: Shto një Shkarkesë/Torrent...

source: Clear Completed
sq: Pastro të Përfunduarit

source: Properties
sq: Veti

source: Filter
sq: Filtër

source: Start Now
sq: Nise Tani

source: Clear Upload
sq: Pastro Ngarkesën

source: Ban User
sq: Dëboje Përdoruesin

source: Share Files...
sq: Shpërnda skeda...

source: View
sq: Pamje

source: Up
sq: Sipër

source: Find
sq: Gjej

source: Create Album...
sq: Krijo Album...

source: Delete Album
sq: Fshije Albumin

source: Add to Playlist
sq: Shtoje te Lista

source: Web Services
sq: Shërbime Rrjeti

source: Move
sq: Lëvize

source: Copy
sq: Kopjo

source: Delete
sq: Fshije

source: Play Album
sq: Luaj Albumin

source: Download All Files
sq: Shkarko Tërë Skedat

source: Play
sq: Luaj

source: Pause
sq: Pusho

source: Seek:
sq: Kërkimi:

source: Seek to a position in the media file
sq: Kërkon në pozicionin e skedës mediatike

source: Volume:
sq: Volumi:

source: Adjust the audio volume
sq: Ndreq volumin e zërit

source: Open File
sq: Hap Skedën

source: Previous
sq: Kaluar

source: Next
sq: Tjetër

source: Playlist
sq: Lista

source: Speed:
sq: Shpejtësi:

source: Adjust the speed of the media file
sq: Ndreq shpejtësinë e skedës mediatike

source: Clear
sq: Pastro

source: Save
sq: Ruaj

source: Connect to IRC
sq: Lidhu te IRC

source: Disconnect
sq: Shkëputu

source: Disconnect from IRC
sq: Shkëputu nga IRC

source: Settings
sq: Vendosje

source: Configure IRC Settings
sq: Konfiguro Vendosjet e IRC

source: Connect To
sq: Lidhu Te

source: Edit Rule
sq: Edito Rregullin

source: Add Rule
sq: Shto Rregull

source: Remove Rule
sq: Hiqe Rregullin

source: Move Up
sq: Lëvize Sipër

source: Move Down
sq: Lëvize Poshtë

source: Reset List
sq: Rivendose Listën

source: Import List
sq: Importo Listën

source: Export List
sq: Eksporto Listën

source: Requery
sq: Ripyete

source: Remove
sq: Fshije

source: G2 Cluster
sq: Copëz G2

source: G2 Cache
sq: Depo G2

source: G1 Cache
sq: Depo G1

source: eDonkey Cache
sq: Depo e eDonkey

source: BitTorrent Cache
sq: Depo e BitTorrent

source: Kademlia Cache
sq: Depo e Kademlia

source: Grant Priority
sq: Përparësi e Dhënies

source: View Album Matches
sq: Shiko Dublimet e Albumit

source: View All Albums
sq: Shiko Tërë Albumet

source: Actual Size
sq: Masa Akuale

source: Best Fit
sq: Masa Perfekte

source: Close
sq: Mbylle

source: _Close Window
sq: _Mbylle Dritaren

source: _Full Screen
sq: _Ekran i Plotë

source: _Restore
sq: _Rivendose

source: _Minimise
sq: _Minimizo

source: _Network
sq: _Rrjet

source: _Connect
sq: _Lidhu

source: Choose _Networks
sq: Zgjidh _Rrjetet

source: Connect to _Gnutella2
sq: Lidhu te _Gnutella2

source: Connect to Gnutella_1
sq: Lidhu te Gnutella_1

source: Connect to _eDonkey
sq: Lidhu te _eDonkey

source: Exit _After Transfers
sq: Dil _Pas Transferimit

source: E_xit
sq: D_alje

source: _View
sq: _Pamje

source: _Home
sq: _Shtëpi

source: _Library
sq: _Librari

source: _Media Player
sq: _MediaLuajtës

source: _Search
sq: _Kërkim

source: _Downloads
sq: _Shkarkim

source: _Remote
sq: _Pult

source: _Advanced
sq: _Avancuar

source: _Neighbours
sq: _Fqinj

source: _Uploads
sq: _Ngarkim

source: Se_curity
sq: Si_guri

source: H_ost Cache
sq: Depo H_osti

source: Disco_very
sq: Zbu_lim

source: _Basic Mode
sq: Mënyrë e _Thjeshtë

source: _Power Mode
sq: Mënyrë e _Avancuar

source: _Tools
sq: _Mjete

source: Share _Files...
sq: _Skedat e Shpërndara...

source: _Download File/Torrent...
sq: Shkarko _Skedë/Torrent...

source: Choose a S_kin...
sq: Zgjidhe L_ëvoren...

source: Choose a _Language...
sq: Zgjidhe _Gjuhën...

source: Edit My _Profile...
sq: Edito _Profilin Tim...

source: QuickStart _Wizard...
sq: _Udhërrëfyesi i Shpejtë...

source: _Shareaza Settings...
sq: Vendosjet e _Shareaza-s...

source: _Help
sq: _Ndihmë

source: Shareaza _FAQ
sq: _PBSH për Shareaza-n

source: _Connection Test
sq: _Testi i Lidhjes

source: _Guides
sq: _Guida

source: Shareaza _Users Guide
sq: Guida e _Përdoruesit

source: _Router Help
sq: Ndihmë për _Ruterin

source: _Security Help
sq: Ndihmë për _Sigurinë

source: _Codec Help
sq: Ndihmë për _Kodekun

source: _Websites
sq: _Troje rrjeti

source: _Shareaza site
sq: Trualli i _Shareaza-s

source: Shareaza _Forums
sq: _Forumet e Shareaza-s

source: Shareaza S_kin Site
sq: Trualli për L_ëvoret e Shareaza-s

source: Check for new _version
sq: Verifiko _versionin e ri

source: _About Shareaza...
sq: _Për Shareaza...

source: _Disconnect
sq: _Shkëputu

source: Connect _To...
sq: Lidhu _Te...

source: _Browse User...
sq: _Shfleto Hostin...

source: _Transfers
sq: _Transferim

source: S_ystem
sq: S_istem

source: _Graph
sq: _Grafikë

source: _Packet Dump
sq: _Paketa

source: Se_arch Monitor
sq: Monitori i Kër_kimit

source: H_it Monitor
sq: Monitori i H_iteve

source: N_ormal Mode
sq: Mënyrë N_ormale

source: T_abbed Mode
sq: Mënyrë me F_usha

source: _Windowed Mode
sq: Mënyrë me _Dritare

source: _Import eMule partial downloads...
sq: _Importo Shkarkesat e Pjesshme nga eMule...

source: _Open my folder of completed Downloads
sq: _Hap Dosjen me Shkarkesat e Përfunduara

source: _Window
sq: _Dritare

source: Show _Navigation Bar
sq: Trego Brezin e _Lundrimit

source: Show _Tool Bar
sq: Trego Brezin e _Mjeteve

source: Show Tab _Bar
sq: Trego _Brezin e Fushës

source: Show _Monitor
sq: Trego _Monitorin

source: Show _Remote
sq: Trego _Pultin

source: New _Search...
sq: _Kërkim i Ri...

source: Close _After Transfers
sq: Mbylle _Pas Transferimit

source: Tile _Horizontal
sq: Hapje _Horizontale

source: Tile _Vertical
sq: Hapje _Vertikale

source: _Open Shareaza
sq: _Hape Shareaza-n

source: _Download File...
sq: _Shkarko Skedë...

source: _Play Media
sq: _Luaj Median

source: Pa_use Media
sq: Pu_sho Median

source: _Stop Media
sq: _Ndale Median

source: P_revious Track
sq: Kolona K_aluar

source: _Next Track
sq: Kolona _Tjetër

source: _Connect Now
sq: _Lidhu Tani

source: Copy _URI
sq: Kopjo _URIn

source: _Priority Server
sq: Server me _Parësi

source: _Remove Host(s)
sq: _Fshije Hostin

source: _Filter
sq: _Filtër

source: Gnutella2 Cl_uster
sq: Co_pëz Gnutella2

source: Gnutella_2 Cache
sq: Depo e Gnutella_2

source: Gnutella_1 Cache
sq: Depo e Gnutella_1

source: _eDonkey Servers
sq: Servera _eDonkey

source: _BitTorrent Cache
sq: Depo e _BitTorrent

source: _Kademlia Cache
sq: Depo e _Kademlia

source: _Import MET File...
sq: _Importo skedën MET...

source: Download MET...
sq: Shkarko MET...

source: _Download
sq: _Shkarko

source: Copy _URI...
sq: Kopjo _URIn

source: _Browse User
sq: _Shfleto Përdoruesin

source: _Chat to User
sq: _Bisedo me Përdoruesin

source: _Search For
sq: _Kërko Për

source: _Similar Files
sq: Skeda _Njësoj

source: _Music by the same Artist
sq: _Muzikë nga ky Artist

source: Music in the same _Album
sq: Muzikë në këtë _Album

source: _Episodes in the same Series
sq: _Episode në këtë Serial

source: _Web Services
sq: Shërbime _Rrjeti

source: Download _Now
sq: Shkarkoje _Tani

source: _Ban User
sq: _Dëboje Përdoruesin

source: _This File
sq: _Këtë Skedë

source: _Filter Results...
sq: _Filtro Rezultatet...

source: _Remove Filter
sq: _Fshije Filtrin

source: C_lear Results
sq: P_astro Rezultatet

source: Edit C_olumns...
sq: Edito K_olonat...

source: _Pause Display
sq: _Pusho Shfaqjen

source: C_lear Display
sq: P_astro Shfaqjen

source: Previe_w File
sq: Parashik_o Skedën

source: R_emote Preview
sq: Parashiko në L_argësi

source: _View Reviews
sq: _Shiko Vlerësimet

source: _Resume Download
sq: _Rimerre Shkarkimin

source: P_ause Download
sq: P_usho Shkarkimin

source: _Cancel Download
sq: _Anulo Shkarkimin

source: _Find More Sources
sq: _Gjej Burime Shtesë

source: _Help...
sq: _Ndihmë...

source: S_hell menu
sq: Meny b_azë

source: Prev_iew Partial File
sq: Paras_hikon Skedën e Pjesshme

source: Add to Pla_ylist
sq: Shtoje te _Lista

source: _Share File
sq: _Shpërnda Skedë

source: _Add Source...
sq: _Shto Burim...

source: Monitor _Window
sq: Dritare e _Monitorit

source: Move _Up
sq: Lëvize _Sipër

source: Move _Down
sq: Lëvize _Poshtë

source: _Ignore Bandwidth Limit
sq: _Përbuze Kufirin e Gjerësisë së Bandës

source: _Properties
sq: _Veti

source: _Access
sq: _Aksesi

source: _Forget
sq: _Harroje

source: _Open or Play
sq: _Hape ose Luaje

source: _Clear
sq: _Pastro

source: _Delete File
sq: _Fshije Skedën

source: _Rate File...
sq: _Vlerëso Skedën...

source: _Stop Seeding
sq: _Ndale Mbjelljen

source: _Properties...
sq: _Veti...

source: C_lear Completed
sq: P_astro të Përfunduarit

source: Aut_o Clear
sq: Auto_pastro

source: _Resume All
sq: _Rimerre Gjithçka

source: P_ause All
sq: P_usho Gjithçka

source: _Clear All
sq: _Pastro Gjithçka

source: _New Group...
sq: Grup i _Ri...

source: Remove _Group
sq: Fshije _Grupin

source: _Show Groups
sq: _Trego Grupe

source: Show _All
sq: Trego _Gjithçka

source: Show A_ctive
sq: Trego A_ktivët

source: Show P_ending
sq: Trego të V_arurit

source: Show _No Sources
sq: Trego _Joburimorët

source: Show _Paused
sq: Trego të _Pushuarit

source: Show All _Sources
sq: Trego Tërë _Burimet

source: _Start Now
sq: _Fillo Tani

source: _Queue Settings
sq: Vendosjet e _Pritjes

source: Show _Queued
sq: Trego të _Radhiturit

source: Show _BitTorrent
sq: Trego _BitTorrent

source: Show _History
sq: Trego _Historinë

source: _Explore
sq: _Eksploro

source: _Remove
sq: _Fshije

source: _Shared
sq: _Shpërndahet

source: Create ._torrent File
sq: Krijo Skedë _.torrent

source: S_can
sq: S_kano

source: Re_build
sq: Ri_ndërto

source: File _Properties
sq: _Vetitë e Skedës

source: _Delete
sq: _Fshije

source: _Export Collection...
sq: _Eksporto Koleksionin...

source: _New Folder...
sq: Dosje e _Re...

source: _Open
sq: _Hape

source: O_rganise
sq: O_rganizo

source: _Rename File
sq: _Riemërto Skedën

source: _Move Files...
sq: _Lëviz Skeda...

source: _Copy Files...
sq: _Kopjo Skeda...

source: _Localise Metadata
sq: _Lokalizo Metadata

source: _Refresh Metadata
sq: _Rifresko Metadata

source: Choose _Columns...
sq: Zgjidh _Kolonat...

source: Remove _Files
sq: Fshiji _Skedat

source: _Play
sq: _Luaj

source: Pa_use
sq: Pu_sho

source: _Stop
sq: _Ndale

source: _Open Media File...
sq: _Hap Skedë Mediatike...

source: Play_list
sq: Lis_ta

source: Pre_vious
sq: Kal_uar

source: _Next
sq: _Tjetër

source: _Random
sq: _Rastësi

source: R_epeat
sq: P_ërsërite

source: Show _Playlist
sq: Trego _Listën

source: Video Si_ze
sq: Ma_sa e Videos

source: _Original Size
sq: Masa _Origjinale

source: _Double Size
sq: Masa _Dyfishe

source: _Triple Size
sq: Masa _Trefishe

source: _Largest
sq: _Më e Madhe

source: _Fill Window
sq: _Mbushe Dritaren

source: Default _Aspect
sq: _Aspekt Tipik

source: _4:3 Ratio (TV)
sq: Raport _4:3 (TV)

source: _16:9 (Film)
sq: Raport _16:9 (Film)

source: Setti_ngs
sq: Vendos_je

source: Choose _Visualisation...
sq: Zgjidhe _Vegimin...

source: Show _Status Line
sq: Trego Vijën e _Statusit

source: _Media Settings...
sq: Vendosjet e _Medias...

source: _Close File
sq: _Mbylle Skedën

source: _Add File...
sq: _Shto Skedë...

source: Add _Folder...
sq: Shto _Dosje...

source: Ra_ndom Mode
sq: Mënyrë Ra_stësore

source: Rep_eat Mode
sq: Mënyrë Pë_rsëritëse

source: _Open Playlist...
sq: _Hap Listën...

source: _Save Playlist...
sq: _Ruaj Listën...

source: _Clear Playlist
sq: _Pastro Listën

source: _Verbose Mode
sq: Mjaft të _Dhëna

source: _Error
sq: _Gabim

source: _Warning
sq: _Kujdes

source: _Notice
sq: _Lajmërim

source: Timestam_p
sq: Me Dat_ë

source: _Copy
sq: _Kopjo

source: Clear _Buffer
sq: Pastro _Zbutësin

source: _Networks
sq: _Rrjete

source: _Monitor
sq: _Monitori

source: View _All Traffic
sq: Shiko _Tërë Trafikun

source: View _Incoming Traffic
sq: Shiko Trafikun _Hyrës

source: View _Outgoing Traffic
sq: Shiko Trafikun _Dalës

source: _Search for This
sq: _Kërko për Këtë

source: _Select Graphs...
sq: _Zgjidh Grafikët...

source: _Grid Lines
sq: _Rrjetë

source: _Axis
sq: _Bosht

source: _Legend
sq: _Legjendë

source: _New Window
sq: Dritare e _Re

source: _Add Rule...
sq: _Shto Rregull...

source: Rese_t
sq: _Rivendose

source: _Import...
sq: _Importo...

source: E_xport...
sq: E_ksporto...

source: Default P_olicy
sq: Meto_da Tipike

source: _Accept
sq: _Prano

source: _Deny
sq: _Moho

source: _Query Now
sq: _Pyete Tani

source: A_dvertise
sq: R_eklamo

source: Browse _Statistics
sq: Shfleto _Statistika

source: Show _Bootstraps
sq: Trego _Bootstrap-et

source: Show _GWebCaches
sq: Trego _GWebDepot

source: Show Ser_ver.met's
sq: Trego Ser_ver.met-et

source: _Add Service...
sq: _Shto Shërbim...

source: Grant _Priority
sq: Parësi e _Dhënies

source: _Format
sq: _Formati

source: Set _Bold
sq: Vendos _Trashësi

source: Set _Italic
sq: Vendos _Pjerrësi

source: Set _Underline
sq: Vendos _Nënvijëzim

source: Set _Colour
sq: Vendos _Ngjyrë

source: _Emoticons
sq: _Gazmorë

source: C_lear Window
sq: P_astro Dritaren

source: _Best Fit
sq: _Masa Perfekte

source: _Actual Size
sq: Masa _Aktuale

source: _Refresh
sq: _Rifresko

source: _Close
sq: _Mbylle

source: _Query
sq: _Pyete

source: Actions
sq: Veprime

source: _Time
sq: _Ora

source: _Version
sq: _Versioni

source: Control
sq: Kontrolli

source: _Ignore
sq: _Përbuz

source: _Unignore
sq: _Mos përbuz

source: _Kick
sq: _Gjuaj

source: Kick (why?)
sq: Gjuaj (pse?)

source: _Ban
sq: _Dëbo

source: _Unban
sq: _Mos dëbo

source: Kick+Ban
sq: Gjuaj+Dëbo

source: Kick+Ban (why?)
sq: Gjuaj+Dëbo (pse?)

source: G E T C O N N E C T E D
sq: L I D H U

source: Welcome to Shareaza!
sq: Mirë se erdhe te Shareaza!

source: You are not currently connected to any peer to peer networks.
sq: Nuk je i lidhur te asnjë rrjet pikë më pikë.

source: Click here to start!
sq: Kliko këtu që të nisësh!

source: S T A R T D O W N L O A D
sq: N I S E S H K A R K I M I N

source: Click here to start
sq: Kliko që të nisësh

source: downloading a new file or torrent.
sq: shkarkimin e një skede ose torrenti të ri.

source: S E A R C H F O R A F I L E
sq: K Ë R K O N J Ë S K E D Ë

source: U P G R A D E N O T I C E
sq: L A J M Ë R I M P Ë R P Ë R M I R Ë S I M

source: Click here to upgrade
sq: Kliko që të përmirësosh

source: W A R N I N G - Y O U A R E F I R E W A L L E D
sq: K U J D E S - J E P A S N J Ë F A J R U O L L I

source: This may cause poor download and search performance.
sq: Kjo mund të shkaktojë shkarkim dhe rendiment të ngadaltë.

source: Click here to learn how to configure your router or firewall
sq: Kliko këtu që të mësosh konfigurimin e ruterit ose fajruollit

source: W A R N I N G - Y O U R T C P P O R T I S F I R E W A L L E D
sq: K U J D E S - P O R T I T C P B L L O K O H E T N G A F A J R U O L L I

source: This may cause poor download performance.
sq: Kjo mund të shkaktojë shkarkim dhe rendiment të ngadaltë.

source: W A R N I N G - Y O U R U D P P O R T I S F I R E W A L L E D
sq: K U J D E S - P O R T I U D P B L L O K O H E T N G A F A J R U O L L I

source: This may cause poor search performance.
sq: Kjo mund të shkaktojë shkarkim dhe rendiment të ngadaltë.

source: C U S T O M I S E S H A R E A Z A
sq: P O R O S I T E S H A R E A Z A - n

source: Skins
sq: Veshje

source: - Change Shareaza's look & feel
sq: - Ndrysho pamjen & ndjesinë e Shareaza-s

source: Settings Wizard
sq: Udhërrëfyesi i Vendosjeve

source: - Edit Shareaza Settings
sq: - Edito vendosjet e Shareaza-s

source: Quick Help
sq: Ndihmë e Shpejtë

source: - Get some basic help using Shareaza
sq: - Merr ndihmën kryesore për përdorimin e Shareaza-s

source: Security Filters
sq: Filtrat e Sigurisë

source: - Add/Remove filters to improve your search results
sq: - Shto/Fshiji filtrat që të përmirësosh rezultatet e kërkimit

source: R E M O T E A C C E S S I S E N A B L E D
sq: Ë S H T Ë A K T I V I Z U A R H Y R J A N Ë L A R G Ë S I

source: Shareaza Remote Access is enabled. Control Shareaza using your web browser at:
sq: Është aktivizuar Aksesi në Largësi i Shareaza-s. Kontrollo Shareaza-n duke përdorur shfletuesin e rrjetit te:

source: - or -
sq: - ose -

source: My Downloads
sq: Shkarkesat e Mia

source: You are not downloading any files yet.
sq: Nuk shkarkon asnjë skedë.

source: Go to Downloads
sq: Shko te Shkarkesat

source: Go to Download (1)
sq: Shko te Shkarkesa (1)

source: Go to Downloads (%i)
sq: Shko te Shkarkesat (%i)

source: My Library
sq: Libraria Ime

source: You have not downloaded any new files recently.
sq: Kohët e fundit nuk ke shkarkuar asnjë skedë të re.

source: files,
sq: skeda,

source: Go to My Library
sq: Shko te Libraria Ime

source: Open my Downloads folder
sq: Dosja e Shkarkesave të Mia

source: Shareaza is scanning and processing
sq: Shareaza skanon dhe proceson

source: files.
sq: skeda.

source: Click here to hash faster
sq: Kliko këtu që të grish më shpejt

source: Click here to hash slower
sq: Kliko që të grish më ngadalë

source: Connection
sq: Lidhje

source: Not connected
sq: I palidhur

source: Click here to connect
sq: Kliko këtu që të lidhesh

source: Disconnected
sq: I shkëputur

source: Connecting...
sq: Lidhje...

source: Connected
sq: I lidhur

source: %i hubs
sq: %i nyja

source: %i leaves
sq: %i gjethe

source: %i ultrapeers
sq: %i ultrapika

source: You have been connected for
sq: Je i lidhur për

source: hours and
sq: orë dhe

source: minutes.
sq: minuta.

source: Uploads
sq: Ngarkesa

source: No active uploads
sq: Asnjë ngarkesë aktive

source: 1 active upload
sq: 1 ngarkesë aktive

source: %i active uploads
sq: %i ngarkesa aktive

source: You have not uploaded any files today.
sq: Sot nuk ngarkon asnjë skedë.

source: You have uploaded 1 file (%s).
sq: Ke ngarkuar 1 skedë (%s).

source: You have uploaded %i files (%s).
sq: Ke ngarkuar %i skeda (%s).

source: Torrents
sq: Torrente

source: No seeding torrents
sq: Nuk mbillet asnjë torrent

source: 1 seeding torrent
sq: 1 torrent i mbjellë

source: %i seeding torrents
sq: %i torrente të mbjella

source: Re-seed %s
sq: RiMbille %s

source: Seed another torrent
sq: Mbill torrent tjetër

source: Seed a torrent
sq: Mbill një torrent

source: General
sq: Përgjithësi

source: Welcome to Shareaza's Settings Manager
sq: Mirë se erdhe te Menaxheri i Vendosjeve të Shareaza-s

source: section relate to the user experience.
sq: kanë të bëjnë me eksperiencën e përdoruesit.

source: General:
sq: Përgjithësi:

source: Common user interface settings like tooltips, minimise behaviour, number formats, prompts, etc.
sq: Vendosjet e ndërfaqes së zakontë të përdoruesit me këshilla, sjelljen e minimizimit, formatet e numrave, lajmërime etj.

source: Library:
sq: Librari:

source: Presentation, access, and management of the file library.
sq: Prezantimi, aksesi dhe menaxhimi i librarisë me skeda.

source: Media Player:
sq: MediaLuajtës:

source: When and where to use the built-in Shareaza Media Centre.
sq: Ku dhe kur përdoret qendra mediatike e Shareaza-s.

source: Community:
sq: Komunitet:

source: Your profile, chat and instant messaging settings.
sq: Vendosjet e profilit, chat-it dhe e mesazheve të çastit.

source: IRC chatroom visual appearances and connection settings.
sq: Pamje figurative e dhomës IRC dhe vendosjet e lidhjes.

source: Web Integration:
sq: Integrimi në Rrjet:

source: Integrate Shareaza with your web browser to accept peer-to-peer links and download content.
sq: Integron Shareaza-n me shfletuesin e rrjetit që të pranojë linket pikë-më-pikë dhe të shkarkojë përmbajtje.

source: Internet
sq: Interneti

source: section control how Shareaza interacts with other nodes within distributed peer-to-peer networks.
sq: tregojnë se si ndërvepron Shareaza me nyjat e tjera në rrjetet pikë-më-pikë të klasifikuara.

source: Connection:
sq: Lidhje:

source: The speeds and capabilities of your Internet connection.
sq: Shpejtësia dhe aftësitë e lidhjes tënde me Internetin.

source: Downloads:
sq: Shkarkim:

source: Download throughput, scheduling, verification, timeouts and management.
sq: Avitja, planifikimi, verifikimi, jashtëkoha dhe menaxhimi i shkarkimit.

source: Uploads:
sq: Ngarkim:

source: Upload capacity, queuing, banning, timeouts and special requests.
sq: Kapaciteti, pritja, dëbimi, jashtëkoha dhe kërkesat e veçanta të ngarkimit.

source: Remote:
sq: Largësi:

source: Set up the ability to control Shareaza remotely through a web browser.
sq: Krijon mundësinë për të kontrolluar Shareaza-n nga larg me një shfletues rrjeti.

source: 's Profile
sq: dhe Profili

source: Name
sq: Emri

source: Location
sq: Vendi

source: Demographic
sq: Demografi

source: Male
sq: Mashkull

source: Female
sq: Femër

source: Contact Information
sq: Informacioni i Kontaktit

source: Interests
sq: Interesa

source: View Shared Files
sq: Shikoni Skedat e Shpërndara

source: Community
sq: Komuniteti

source: Favourite Web Links
sq: Linke Rrjeti Favorite

source: Downloads Area
sq: Zona e Shkarkesave

source: This Torrent is Seeding
sq: Ky Torrent Mbillet

source: This Download has Completed
sq: Kjo Shkarkesë Përfundon

source: This Download is Moving
sq: Kjo Shkarkesë Lëvizet

source: This Download is Paused
sq: Kjo Shkarkesë Pushon

source: The Disk is Full
sq: Disku Është Plot

source: This Download is Verifying
sq: Kjo Shkarkesë Verifikohet

source: This Download is Active!
sq: Kjo Shkarkesë është Aktive!

source: Find More Sources
sq: Gjej më Shumë Burime

source: This Download is Pending
sq: Kjo Shkarkesë Varet

source: This Download is Queued
sq: Kjo Shkarkesë Vendoshet në Pritje

source: This Download is Searching
sq: Kjo Shkarkesë Kërkon

source: This Download is Creating
sq: Kjo Shkarkesë Krijon

source: BitTorrent Tracker Down
sq: Gjurmuesi BitTorrent Bie

source: Uploads Area
sq: Zona e Ngarkesave

source: Disk Space is Low
sq: Hapësira e Diskut është e Ulët

source: The amount of free space on one or more drives used by Shareaza is low.
sq: Hapësira e lirë në një ose disa prej disqeve që përdoren nga Shareaza është e ulët.

source: A Required Directory is Non-writable
sq: Një Direktori e Kërkuar Nuk Shkruhet
