Repository: quazaa-development-team/Shareaza
Catalog: trunk/Languages/default-*.po
Languages: sq

source: Protocols
sq: Protokolle

source: Shareaza Common Architecture Protocol Explorer:
sq: Eksploruesi i Protokollit Arkitekturor të Zakontë i Shareaza-s:

source: Skin Information:
sq: Informacioni i Veshjes:

source: Name:
sq: Emri:

source: Author:
sq: Autori:

source: Description:
sq: Përshkrimi:

source: Install...
sq: Instalo...

source: Get More
sq: Gjej më Shumë

source: Plugins
sq: Spina

source: Plugin Information:
sq: Informacioni i Spinës:

source: _Setup...
sq: _Ndërto...

source: Set Default
sq: Vendos Tipiket

source: Setting Properties:
sq: Vetitë e Vendosjes:

source: Value:
sq: Vlera:

source: Upload Queue Properties
sq: Vetitë e Ngarkesës në Radhë

source: _Name:
sq: _Emri:

source: _Entry Criteria:
sq: Kriteri i _Hyrjes:

source: Partially downloaded files only
sq: Vetëm skeda të shkarkuara pjesërisht

source: Shared Library files only
sq: Vetëm skeda të shpërndara në Librari

source: Both partial and library files
sq: Edhe skeda të pjesshme, edhe të librarisë

source: Minimum source file size:
sq: Masa min. e skedëburimit:

source: Maximum source file size:
sq: Masa maksimale e skedës burim:

source: Marked files:
sq: Skedat e shënuara:

source: Popular|Release
sq: Popullor|Lëshim

source: Filename match:
sq: Dublimi i emrit:

source: Protocols:
sq: Protokolle:

source: _Capacity:
sq: _Kapaciteti:

source: Enable this queue
sq: Lejo punën në radhë

source: Minimum number of transfers:
sq: Numri minimal i transfertave:

source: Maximum number of transfers:
sq: Numri maksimal i transfertave:

source: Maximum number waiting in queue:
sq: Numri maksimal i pritjeve në radhë:

source: _Service Parameters:
sq: Parametra të _Shërbimit:

source: Saturated bandwidth percentage:
sq: Pjesa e ngopur e shtri. së bandës:

source: Upload bandwidth for this queue:
sq: Gjerësi e bandës për punët në radhë:

source: Rotate after N seconds:
sq: Rrotullo pas N sekondash:

source: Reward uploaders
sq: Shpërbleji ngarkuesit

source: If you haven't used Shareaza or another P2P client before, this QuickStart wizard can help you configure your copy in a few simple steps.
sq: Nëse nuk e ke përdorur ndonjëherë Shareaza-n apo një klient tjetër P2P, me këtë udhërrëfyes të shpejtë do mund ta konfigurosh atë sipas disa hapave të thjeshtë.

source: If you're a more advanced user, you can access the full range of Shareaza's options via the Tools menu. Click Exit to close the wizard at any time.
sq: Nëse je përdorues më i avancuar, mund të hapësh gamën e gjerë të mundësive të Shareaza-s, në menynë Mjete. Kliko Dalje që ky udhërrëfyes të mbyllet në çdo kohë.

source: This wizard will assist you to:
sq: Udhërrëfyesi do ndihmojë në:

source: Tell Shareaza about your Internet connection
sq: Njohjen e Shareaza-s me lidhjen tënde të Internetit

source: Choose which files to share
sq: Zgjedhjen e skedave për t'u shpërndarë

source: Connect to your choice of P2P networks, and
sq: Lidhjen te rrjetet P2P që të pëlqejnë, dhe

source: Get started using Shareaza.
sq: Nisjen e përdorimit të Shareaza-s.

source: Welcome to Shareaza (1/6)
sq: Mirë se erdhe te Shareaza (1/6)

source: For optimum performance, Shareaza needs to know a little bit about your connection to the Internet.
sq: Për efektshmëri optimale, Shareaza duhet të dijë si je i lidhur në Internet.

source: Choose the type of your Internet connection:
sq: Zgjidhe llojin e lidhjes në Internet:

source: Dial up Modem|ISDN|ADSL (256K)|ADSL (512K)|ADSL (768K)|ADSL (1.5M)|ADSL (4.0M)|ADSL2 (8.0M)|ADSL2 (12.0M)|ADSL2+ (24.0M)|Cable Modem/SDSL|T1|T3|LAN|OC3
sq: Modem Dial up|ISDN|ADSL (256K)|ADSL (512K)|ADSL (768K)|ADSL (1.5M)|ADSL (4.0M)|ADSL2 (8.0M)|ADSL2 (12.0M)|ADSL2+ (24.0M)|Modem me Kabllo/SDSL|T1|T3|LAN|OC3

source: Or choose the download speed:
sq: Ose shpejtësinë e shkarkimit:

source: and the upload speed:
sq: shpejtësinë e ngarkimit:

source: Do you want to automatically setup port-forwarding by using UPnP?
sq: Do që përcjellja e portit të ndërtohet automatikisht me UPnP?

source: Welcome to Shareaza (2/6)
sq: Mirë se erdhe te Shareaza (2/6)

source: P2P networks are only as good as the people who use them. All of the content available for download is being shared by another user.
sq: Rrjeti P2P është po aq i mirë sa njerëzit që e përdorin atë. Tërë përmbajtja që vlen për t'u shkarkuar shpërndahet nga një përdorues tjetër.

source: You do not have to share content to use Shareaza, however some software will behave differently to users who are not sharing anything.
sq: Për të përdorur Shareaza-n nuk duhet patjetër të shpërndahet përmbajtje, porse disa softuerë sillen ndryshe me përdoruesit që nuk shpërndajnë asgjë.

source: Please indicate which folders, if any, you wish to share. Simply click the Add button to add a new folder.
sq: Të lutem trego cilat dosje, nëse ke, dëshiron të shpërndash. Që të shtosh një dosje të re, thjesht kliko butonin Shto.

source: _Add...
sq: _Shto...

source: WARNING: Distributing copyrighted works is an offence in most countries.
sq: KUJDES: Përhapja e veprave me copyright dënohet në shumicën e vendeve.

source: Scanning Folder...
sq: Skanim i Dosjes...

source: Files:
sq: Skeda:

source: Size:
sq: Masa:

source: Welcome to Shareaza (3/6)
sq: Mirë se erdhe te Shareaza (3/6)

source: Shareaza is a much friendlier place when everyone writes a few basic details about themselves.
sq: Shareaza është një vend miqësor ku secili mund të shkruajë disa detaje themelore rreth vetes.

source: I use the name:
sq: Unë quhem:

source: and I'm a:
sq: dhe jam:

source: (choose)
sq: (zgjidhe)

source: (choose)| guy| girl| man| woman
sq: (zgjidhe)| djalë| vajzë| burrë| grua

source: from:
sq: nga:

source: Welcome to Shareaza (4/6)
sq: Mirë se erdhe te Shareaza (4/6)

source: Shareaza supports a flexible user interface, so you can choose what is most comfortable for you. You can change these options at any time.
sq: Shareaza përkrah një ndërfaqe përdoruesi të ndryshueshme, ndaj mund të zgjedhësh se cila të shkon. Këto mundësi mund të ndërrohen kurdoherë.

source: Please select user interface:
sq: Të lutem zgjidhe ndërfaqen e përdoruesit:

source: Basic Mode
sq: Mënyrë Kryesore

source: Power Mode
sq: Mënyrë e Avancuar

source: Simple, easy to use menus and buttons.{n}Familiar to users of other file sharing programs.
sq: E thjeshtë, e lehtë për të përdorur menytë dhe butonat.{n}Ngjan për përdoruesit si programet e tjera për të shpërndarë skeda.

source: Power mode offers expert users lots of extra commands, windows, etc.{n}It may be a little confusing for new users!
sq: Kjo u ofron përdoruesve ekspertë shumë komanda shtesë, dritare etj.{n}Mund t'i hutojë pak përdoruesit e rinj!

source: Display simplified download progress bars. (Reduces CPU use)
sq: Breza të thjeshtuar të progresit të shkarkimit. (Ul shfrytëzimin e CPU-së)

source: Handle torrent links.
sq: Trajto linket torrent.

source: Welcome to Shareaza (5/6)
sq: Mirë se erdhe te Shareaza (5/6)

source: Shareaza is a general-purpose file-sharing application that can access many P2P networks at the same time. Here you can select which networks you'd like to access. Note that you can always select different networks later.
sq: Shareaza është një aplikim skedë-shpërndarës me synimin kryesor hyrjen në sa më shumë rrjete P2P në një kohë. Këtu mund të zgjedhësh në cilat rrjete do të hysh. Vëre se mund të zgjedhësh rrjete të ndryshme, edhe më vonë.

source: Connect to Gnutella2 (Highly Recommended)
sq: Lidhu te Gnutella2 (Rekomandohet fort)

source: The Gnutella2 network is Shareaza's premiere network, offering more features and performance than any other P2P net.
sq: Rrjeti Gnutella2 është rrjeti parësor i Shareaza-s, i cili ofron më tepër veçori dhe efektshmëri se çdo rrjet P2P.

source: Import eDonkey Downloads
sq: Importoni Shkarkesa nga eDonkey

source: Shareaza has detected that you have another eDonkey program installed on your computer. Would you like to import any unfinished downloads into Shareaza?
sq: Shareaza dikton se në kompjuter është instaluar një program eDonkey. Do që çdo shkarkim i papërfunduar të importohet te Shareaza?

source: No|Cancel
sq: Jo|Anulo

source: Welcome to Shareaza (6/6)
sq: Mirë se erdhe te Shareaza (6/6)

source: That's it! Shareaza has been configured to work with your computer.
sq: Kaq ishte! Konfigurove Shareaza-n për të punuar në këtë kompjuter.

source: If you ever need to change your settings, you can re-run this QuickStart wizard by selecting it from the Tools menu.
sq: Nëse do t'i ndryshosh përsëri vendosjet, udhërrëfyesi i shpejtë rihapet duke zgjedhur menynë Mjete.

source: After closing this wizard by clicking Finish, you can connect to the networks you selected and start searching and downloading content.
sq: Kur të mbyllet udhërrëfyesi duke klikuar Përfundo, mund të lidhesh në rrjetet që zgjodhe dhe të nisësh kërkimin e shkarkimin e përmbajtjeve që dëshiron.

source: Connect to the network when I close this wizard
sq: Lidhu në rrjet kur mbyllet ky udhërrëfyes

source: Connect to the network every time I start Shareaza
sq: Lidhu në rrjet sa herë nis Shareaza

source: Start Shareaza every time Windows starts
sq: Hape Shareaza-n sa herë nis Windows-i

source: Enjoy using Shareaza!
sq: Kënaqu me Shareaza-n!

source: Identity
sq: Identiteti

source: _Names:
sq: _Emrat:

source: Screen Name:
sq: Emri i shfaqur:

source: Real Name:
sq: Emri i vërtetë:

source: _Vitals:
sq: _Jetësore:

source: Male|Female
sq: |Mashkull|Femër

source: Gender:
sq: Gjinia:

source: Age:
sq: Mosha:

source: Allow others to browse my user profile
sq: Lejo përdoruesit e tjerë që të shfletojnë profilin tim si përdorues

source: Contact
sq: Kontakti

source: _Email Addresses:
sq: _Adresa e postës-e:

source: Primary:
sq: Parësore:

source: _Instant Messaging:
sq: Lajmëtar _Çasti:

source: MSN/.NET Passport:
sq: Pasaporta MSN/.NET:

source: Yahoo ID:
sq: ID në Yahoo:

source: AOL Screen Name:
sq: Emri në AOL:

source: Jabber ID:
sq: ID në Jabber:

source: _Location:
sq: _Vendndodhje:

source: Country:
sq: Shteti:

source: City:
sq: Qyteti:

source: _Mapping:
sq: _Pozicioni në Hartë:

source: Latitude:
sq: Gjer. Gjeo.:

source: Longitude:
sq: Gjat. Gjeo.:

source: _Interests:
sq: _Interesi:

source: < Add
sq: < Shto

source: Remove >
sq: Fshije >

source: Avatar
sq: Foto

source: _Preview:
sq: _Parashikimi:

source: _Select:
sq: _Zgjedhje:

source: Other users browsing your profile and shared files will see your avatar. Custom avatars should be 128x128 pixels, and can be in any supported image file on your PC.
sq: Përdoruesit e Gnutella-s që shfletojnë profilin/skedat që ti shpërndani do e shikojnë foton tënde. Fotot me porosi duhet të jenë 128x128 pikselë dhe në çdo format imazhi që përkrah kompjuteri yt.

source: _Browse...
sq: _Shfleto...

source: Favourites
sq: Favorite

source: _Edit:
sq: _Edito:

source: Title:
sq: Titulli:

source: New
sq: I Ri

source: Files
sq: Skeda

source: _Favourite Files:
sq: Skeda _Favorite:

source: Favourite files are recommended to users who browse your profile. You can create favourite files by adding them to the "Favourites" library folder.
sq: Skedat favorite rekomandohen për përdoruesit që shfletojnë profilin tënd. Ato mund të krijohen duke i shtuar në dosjen e librarisë, "Favorite".

source: Certificate
sq: Certifikata

source: Users are identified by a globally unique identifier and a corresponding public and private key pair. Normally there is no need to generate a new ID, however Shareaza provides this option for advanced users.
sq: Përdoruesit e Gnutella-s identifikohen nga një identifikues botërisht unik dhe nga një publik i caktuar e numër i parë privat. Normalisht nuk është se duhet të gjeneroni një ID të re, gjithsesi Shareaza e ofron këtë mundësi për përdoruesit e avancuar.

source: _Globally Unique Identification Certificate:
sq: Certifikata Unike e Identifikimit Mbarëbotëror të _Gnutella-s:

source: Created:
sq: Krijimi:

source: Generate New
sq: Gjenero të Ri

source: Select Language
sq: Zgjidheni Gjuhën

source: Connect To|Browse User|Chat to User
sq: Lidhuni Te|Shfletoni Hostin

source: Initiate a new connection to host or server:|Browse this user:|Chat to this user:
sq: Nis një lidhje të re te hosti/serveri:|Shfleto këtë host:

source: Network _Protocol:
sq: _Protokolli i Rrjetit:

source: _Suppress Ultrapeer
sq: _Shtype Ultrapikën

source: Downloading any file with Shareaza is easy. Simply type or paste the URL or URI describing the file into the box below and press Enter.
sq: Shkarkimi i skedave me Shareaza është mjaft i lehtë. Thjesht shkruaj ose ngjit më poshtë një URL/URI që përshkruan skedën dhe shtyp Enter.

source: Shareaza can download files from the web (HTTP), and automatically search and download P2P links (Magnet, Gnutella, eDonkey, mP2P).
sq: Shareaza mund të shkarkojë skeda nga rrjeti (HTTP) si edhe të kërkojë e shkarkojë automatikisht nga linket P2P (Magnet, Gnutella, eDonkey, mP2P).

source: Shareaza can also download BitTorrent files. A torrent can be described by a .torrent file, or a HTTP link to the .torrent file. To download a torrent HTTP link, paste it in the box above. If you already have a .torrent file, click Open Torrent:
sq: Shareaza mund të shkarkojë edhe skedat e BitTorrent. Torrenti përshkruhet nga një skedë .torrent ose një link HTTP i skedës .torrent. Për të shkarkuar torrent nga një link HTTP, vendose atë më sipër. Nëse ke një skedë .torrent, kliko Hap Torrent.

source: Open _Torrent...
sq: Hap _Torrent...

source: New Search|Search Again|Find in Library
sq: Kërkim i Ri|Kërko Përsëri|Gjej në Librari

source: Filter Matches
sq: Filtroni Krahasimet

source: Only show matches which include the _words:
sq: Trego vetëm krahasime me _fjalë:

source: ( you can also exclude words with -word )
sq: ( mund të përjashtohen edhe fjalët me -fjalë )

source: And are of _size:
sq: Dhe që kanë _masë:

source: Minimum:
sq: Minimumi:

source: Maximum:
sq: Maksimumi:

source: With at least:
sq: Me të paktën:

source: sources.
sq: burime.

source: _Hide:
sq: _Fshehje:

source: Busy hosts
sq: Hostet e zëna

source: Non-matching files
sq: Hoste në fajruoll/shtytje

source: Firewalled/push hosts
sq: Hostet e lëkundura

source: Files you have already
sq: Skedat jo të njëjta

source: Unstable hosts
sq: Skedat e mëparshme

source: Bogus results
sq: Rezultate false

source: DRM files
sq: Skedat DRM

source: Adult results
sq: Rezultate për të rritur

source: Suspicious files
sq: Skedat e dyshimta

source: Filters:
sq: Filtro

source: Set as default
sq: Vendose si tipik

source: _Save as
sq: _Ruaje si

source: Save filter as
sq: Ruani filtrin si

source: Save the current filter as
sq: Ruaje filtrin aktual si:

source: Discovery Service
sq: Shërbime Zbulimi

source: Service _Address:
sq: _Adresa e Shërbimit:

source: Discovery Service Type:
sq: Lloji i Shërbimit të Zbulimit:

source: Gnutella Bootstrap|G1 GWebCache|G2 GWebCache|G1/G2 GWebCache|Server.met URL|DC++ Hub List URL|Blocked
sq: Gnutella Bootstrap|G1 GWebCache|G2 GWebCache|G1/G2 GWebCache|URL e Server.met|DC++ Hub List URL|Bllokuar

source: Download : Shareaza
sq: Shkarko : Shareaza

source: Close this window when the download completes
sq: Mbylle dritaren kur përfundon shkarkimi

source: View Library
sq: Shiko Librarinë

source: Hide
sq: Fshehe

source: Universal Resource Names (URNs)
sq: Emri Burimor Universal (URN)

source: File Attributes
sq: Atributet e Skedës

source: Location:
sq: Vendi:

source: Modified:
sq: Modifikimi:

source: My Review
sq: Vlerësimi Im

source: My Rating
sq: Vlerësimi im

source: I rate this file:
sq: Këtë skedë e vlerësoj:

source: (No Rating)|Fake/Corrupt/Misleading|Poor|Average|Good|Very Good|Excellent
sq: (Pa vlerësim)|False/Korruptuar/Keqprijëse|Dobët|Mesatare|Mirë|Shumë mirë|Shkëlqyer

source: My Review and Comments
sq: Vlerësimi dhe Komentet e Mia

source: Sharing
sq: Shpërndarje

source: Simple Sharing
sq: Shpërndarje e Thjeshtë

source: Share this file if the parent folder is shared
sq: Shpërndaje skedën nëse dosja mëmë shpërndahet

source: Override sharing setting for this file:
sq: Refuzo vendosjet për shpërndarjen e skedës:

source: Make this file available to other users
sq: Bëje skedën të vlefshme për përdoruesit e tjerë

source: Upload Queue Selection Tag(s)
sq: Ngarko Etiketat për të Zgjedhur Punët në Radhë

source: -Networks to Share On
sq: -Rrjetet ku do Shpërndani

source: Sources
sq: Burime

source: Known Sources
sq: Burimet e Njohura

source: Add New Source
sq: Shto një Burim të Ri

source: Copy Files|Move Files
sq: Kopjo Skedat|Lëviz Skedat

source: You have selected %i file(s) to copy to the following folder:
sq: Zgjodhët që në dosjen më poshtë të kopjoni %i skedë(a):

source: Ready...
sq: Gati...

source: You have selected %i file(s) to move to the following folder:
sq: Zgjodhët që në dosjen më poshtë të lëvizni %i skedë(a):

source: Album Folder Properties
sq: Vetitë e Dosjes si Album

source: Album Folder Title:
sq: Titulli i Dosjes si Album:

source: Folder Type:
sq: Lloji i Dosjes:

source: Add this information to the files contained in the folder
sq: Përdor këto veti në çdo skedë të dosjes

source: Traffic Graphs
sq: Grafikët e Trafikut

source: _Show:
sq: _Shfaqe me:

source: Grid Lines
sq: Rrjetë

source: Vertical Axis
sq: Bosht Vertikal

source: Legend
sq: Legjendë

source: Sampling _Frequency:
sq: _Frekuenca e Vrojtimit:

source: Period between samples:
sq: Periudha midis shembujve:

source: Graph Item Properties
sq: Vetitë e Njësisë Grafike

source: _Source:
sq: _Burimi:

source: Multiplier:
sq: Shumësi:

source: Units:
sq: Njësia:

source: _Display:
sq: _Ekranizimi:

source: Select Colour...
sq: Zgjidhe ngjyrën...

source: Select Columns from Schema
sq: Zgjidhini Kolonat nga Skema

source: Select a schema from the list, then select the fields to display as columns.
sq: Zgjidhe një skedë nga lista, pastaj zgjidhi fushat që do të shfaqen si kolona.

source: Security Rule
sq: Rregulli i Sigurisë

source: _Rule:
sq: _Rregulli:

source: Network (IP) Address|Content Filter
sq: Adresa e Rrjetit (IP)|Filtër i Përmbajtjes

source: Comment:
sq: Komenti:

source: _Network Address:
sq: Adresa e _Rrjetit:

source: IP Address:
sq: Adresa IP:

source: Netmask:
sq: Netmaska:

source: _Content Filter:
sq: Filtri i _Përmbajtjes:

source: Match Any
sq: Krahaso Disa

source: Match All
sq: Krahaso Gjithçka

source: Action:
sq: Veprimi:

source: None|Accept|Deny
sq: Asnjë|Pranoje|Mohoje

source: Expire:
sq: Skadimi:

source: Never (Indefinite)|At End of Session|After:
sq: Kurrë (e papërcaktuar)|Në Fund të Sesionit|Pas:

source: h
sq: o

source: Shared Folder Manager
sq: Menaxheri i Dosjeve të Shpërndara

source: This is a list of folders in your library. You can add and remove folders using the buttons on the left. When you add a new folder it is initially shared with other users, however you can unshare it from the Shareaza library if you wish.
sq: Kjo është lista me dosje në librarinë tënde. Dosjet mund të shtohen dhe hiqen duke përdorur butonat majtas. Kur shtohet një dosje e re, në fillim ajo shpërndahet me përdoruesit e tjerë; gjithsesi, kjo mund të çaktivizohet në librarinë e Shareaza-s.

source: Copy URI
sq: Kopjoni URIn

source: You can copy a URI for the selected item in a variety of different formats. Please choose the format you wish to use by clicking one of the URIs below:
sq: Mund të kopjosh një URI për njësinë e zgjedhur në një mori formatesh të ndryshme. Të lutem zgjidhe formatin që dëshiron të përdorësh duke klikuar një nga URI-t më poshtë:

source: Include _myself as a fixed source in the URL
sq: Përfshije _vetveten si një burim i ngulitur në URL

source: Export URIs
sq: Eksportoni URIn

source: You have selected %lu files to export as Shareaza-powered URI references. Please select the format for the URIs, and click Save:
sq: Zgjodhe %lu skeda për të eksportuar si referenca URI me fuqi në Shareaza. Të lutem zgjidhe formatin për URI-t, dhe kliko Ruaje:

source: Insert Token:
sq: Fusni Dallimin:

source: Tiger Root|SHA1|MD5|ED2K (CMD4)|BitTorrent|Filename|Filename (URI)|Base Filename|File Extension|File Size|File Size (bytes)|Folder Path|Local Host|Local Port|Link|Link (URI)
sq: Tiger Root|SHA1|MD5|ED2K (CMD4)|BitTorrent|Emri i skedës|Emri i skedës (URI)|Emri bazë i skedës|Shtojca e skedës|Masa e skedës|Masa e skedës (bajte)|Shtegu i dosjes|Hosti Lokal|Porti Lokal|Link|Link (URI)

source: Select preset:
sq: Zgjidhe paravendosjen:

source: _Save...
sq: Ruaje...

source: Shareaza URI Manager
sq: Menaxheri i URIve te Shareaza

source: You have clicked on a Shareaza-powered URI which links to the following content on the network:
sq: Klikuat një URI me fuqi në Shareaza, i cili lidhet në rrjet me këtë përmbajtje:

source: You have clicked on a Shareaza-powered URL which will connect you to the following host or server:
sq: Klikuat një URL me fuqi në Shareaza, e cila do të lidhet te hosti ose serveri më poshtë:

source: You have clicked on a Shareaza-powered URI which will allow you to browse the shared files available on the following host:
sq: Klikuat një URI me fuqi në Shareaza, i cili do lejojë të shfletoni skedat me vlerë të shpërndara në hostin më poshtë:

source: Please select the action you would like Shareaza to take:
sq: Të lutem zgjidhe si të veprojë Shareaza:

source: _Download Now
sq: _Shkarko Tani

source: _Search for File
sq: _Kërko Skedën

source: _Remember my selection next time
sq: _Mbaje mend këtë zgjedhjen

source: You have clicked on a Shareaza-powered URI which will add the following Discovery Service to your Discovery Services cache.
sq: Ke klikuar në një URI me fuqi në Shareaza i cili do e shtojë Shërbimin Zbulues të mëposhtëm në depon tënde për Shërbimin Zbulues.

source: Smart Download Preview...
sq: Parashikim i Shkarkimit Inteligjent...

source: Shareaza is creating a preview of the download:
sq: Shareaza krijon një parashikim të shkarkimit:

source: (copying downloaded chunks to a new preview file)
sq: (kopjim i thelave te shkarkuara te një skedë e re parashikuese)

source: Shareaza Respects its Users
sq: Shareaza Respekton Përdoruesit e saj

source: Did you know Shareaza is a 100% free product?
sq: A e dinit që Shareaza është një produkt 100% falas?

source: Shareaza does NOT contain ANY "spyware", "adware" or other bundled software. It does NOT display any advertisements or "popups", ever.{n}{n}If you ever see advertising or "popups" while using Shareaza, be assured that they are NOT coming from this program.
sq: Shareaza NUK përmban ASNJË "spiunues", "reklamues" apo ndonjë softuer tjetër të paketuar. Reklamat ose "kërcyeset" NUK shfaqen kurrë.{n}{n}Nëse gjatë përdorimit vëreni ndonjë reklamë ose "kërcyese", të jeni të sigurt se ato NUK janë të programit.

source: Unfortunately a lot of other software does come with undesirable adware or spyware, so if you see something suspicious you may wish to check your PC with an advertising or spyware removal program.
sq: Për fat të keq, shumë nga softuerët e tjerë bartin reklamuesa apo spiunuesa të padëshirueshëm, ndaj nëse keni dyshime verifikoni PC-në tuaj me një program që heq reklamuesat e spiunuesat.

source: You should not have had to pay any money to obtain Shareaza. Shareaza can be freely downloaded by anyone from http://shareaza.sourceforge.net/. If you paid someone money for Shareaza, you should demand a full refund immediately.
sq: Për Shareaza-n nuk duhet të paguani! Shareaza mund të shkarkohet lirisht nga kushdo në http://shareaza.sourceforge.net/. Nëse keni paguar për të, duhet të kërkoni menjëherë një kthim të plotë parash.

source: Shareaza respects its users!
sq: Shareaza respekton përdoruesit e saj!

source: Spread the Word
sq: Ngrini Zërin

source: Help Us Spread the Word
sq: Na ndihmoni të Ngremë Zërin
