Repository: quazaa-development-team/Shareaza
Catalog: trunk/Languages/default-*.po
Languages: sq

source: A disk or directory Shareaza needs cannot be written to.
sq: Te disku ose direktoria që nevojitet nga Shareaza nuk mund të shkruhet.

source: Internet Connection Has Been Lost
sq: Mungon Lidhja me Internetin

source: Windows reports that there is no internet connection is available.
sq: Windows raporton se nuk je i lidhur në Internet.

source: Shareaza has ceased connection attempts to avoid losing all cached hosts.
sq: Shareaza ndal orvatjet për lidhje që të shmangë humbjen e ndonjë hosti në depo.

source: Adult content filter enabled
sq: Aktivizohet Filtri i përmbajtjeve për të rritur

source: Children's Internet use (including P2P file sharing) should always be under parental supervision.
sq: Përdorimi i Internetit nga fëmijët (përfshirë shpërndarjen P2P) gjithmonë duhet të kryhet nën vëzhgimin e prindërve.

source: This torrent appears to have an encoding error
sq: Ky torrent duket se ka gabime në kodim

source: Click here for additional help
sq: Kliko për ndihmë shtesë

source: , or to download software to repair the torrent.
sq: , ose për të shkarkuar softuerë për riparimin e torrenteve.

source: Your eDonkey server list is empty
sq: Lista e serverit eDonkey është bosh

source: Limiting uploads may slow downloads
sq: Kufizimi i ngarkesave mund të ngadalësojë shkarkimin

source: Please re-phrase the search
sq: Të lutem rishkruaj kërkimin

source: Further help is available on the Shareaza web site.
sq: Për ndihmesë të mëtejshme, shko te trualli i Shareaza-s.

source: This search cannot be started
sq: Ky kërkim nuk mund të nisë

source: Already Shared
sq: Tashmë i Shpërndarë

source: The folder you have selected is already being shared as part of an existing share.
sq: Dosja që zgjodhe shpërndahet që më parë si pjesë e një shpërndarjeje ekzistuese.

source: This folder should not be shared
sq: Kjo dosje nuk duhet shpërndarë

source: inside
sq: brenda

source: View the user's shared files
sq: Shikon skedat që shpërndan përdoruesi

source: Browse the selected user's profile and shared files.
sq: Shfleton profilin e përdoruesit dhe skedat që ai shpërndan.

source: Browse the user's profile.
sq: Shfleton profilin e përdoruesit.

source: Refresh the list of files available on this host.
sq: Rifreskon listën me skedat e vlefshme në host.

source: Stop browsing files on this host.
sq: Ndalon shfletimin e skedës në host.

source: Apply bold formatting (Ctrl+B)
sq: Zbaton formatim të trashë (Ctrl+B)

source: Browse the user's profile and shared files.
sq: Shfleton profilin e përdoruesit dhe skedat që ai shpërndan.

source: Clear the message text in this window.
sq: Pastron tekstin në dritare.

source: Select a text colour (Ctrl+K)
sq: Zgjedh ngjyrën e tekstit (Ctrl+K)

source: Connect to the chat session.
sq: Lidh sesionin e chat-it.

source: Disconnect the chat session.
sq: Shkëput sesionin e chat-it.

source: Insert an emoticon.
sq: Vendos një emoticon.

source: Apply italic formatting (Ctrl+I)
sq: Zbaton formatim të pjerrët (Ctrl+I)

source: Grant upload priority to this user.
sq: Lejon parësinë e ngarkimit tek përdoruesi.

source: Show the time when each message was received.
sq: Tregon kohën kur shfaqen mesazhet.

source: Apply underline formatting (Ctrl+U)
sq: Zbaton formatim me nënvizim (Ctrl+U)

source: Close the active window.
sq: Mbyll dritaren aktive.

source: Enlarge the active window to fill the window.
sq: Zmadhon dritaren aktive sa për të mbushur dritaren.

source: Minimise the selected window to the tab bar.
sq: Minimizon në shufër dritaren e zgjedhur.

source: Open the selected window.
sq: Hap dritaren e zgjedhur.

source: Add a new discovery service...
sq: Shton një shërbim zbulues të ri...

source: Advertise the selected GWebCache service to a random existing GWebCache.
sq: Reklamon shërbimin e zgjedhur GWebDepo në një GWebDepo ekzistues rastësor.

source: Browse statistics for the selected GWebCache service on the Web.
sq: Shfleton statistikat për shërbimin e zgjedhur GWebDepo në Rrjet.

source: View the properties for the selected discovery service.
sq: Shikon vetitë e shërbimit zbulues të zgjedhur.

source: Show bootstrap services in the Discovery window.
sq: Tregon shërbimet bootstrap në dritaren Zbulimi.

source: Query the selected discovery services now.
sq: Heton menjëherë shërbimin zbulues të zgjedhur.

source: Remove the selected discovery services.
sq: Fshin shërbimin zbulues të zgjedhur.

source: Show eDonkey Server.met services in the Discovery window.
sq: Tregon shërbimet e Server.met të eDonkey në dritaren Zbulimi.

source: Show GWebCache services in the Discovery window.
sq: Tregon shërbimet GWebDepo në dritaren Zbulimi.

source: Cancel and remove all downloads in this group.
sq: Anulon dhe heq tërë shkarkesat në grup.

source: Create a new download group...
sq: Krijon një grup të ri shkarkimi...

source: Pause all downloads in this group.
sq: Pushon tërë shkarkesat në grup.

source: Edit the properties of the selected download group.
sq: Editon vetitë e grupit të zgjedhur për shkarkim.

source: Remove the selected download group.
sq: Fshin grupin e zgjedhur për shkarkim.

source: Resume all downloads in this group.
sq: Rimerr tërë shkarkesat në grup.

source: Show or hide the download group bar.
sq: Tregon ose fsheh shufrën e grupit për shkarkim.

source: Automatically clear downloads which have been completed.
sq: Pastron automatikisht shkarkesat që kanë përfunduar.

source: Boost the performance of the selected download by removing bandwidth limits.
sq: Rrit rendimentin e shkarkesës së zgjedhur duke hequr kufijtë e shtrirjes së bandës.

source: Clear/remove the selected download(s).
sq: Pastron/heq shkarkesën e zgjedhur.

source: Remove the selected download(s) from the list.
sq: Fshin nga lista shkarkesën e zgjedhur.

source: Clear downloads which have been completed.
sq: Pastron shkarkesën e përfunduar.

source: Cancel the selected incomplete download(s).
sq: Anulon shkarkesën e zgjedhur të papërfunduar.

source: Clear downloads which have been paused.
sq: Pastron shkarkesën në pushim.

source: Copy the URI of the selected file.
sq: Kopjon URI-n e skedës së zgjedhur.

source: Show the advanced download properties...
sq: Tregon një ndërfaqe të avancuar për të edituar...

source: Add the selected download(s) to your media playlist.
sq: Shton shkarkesën e zgjedhur në listën për mediat.

source: Delete the selected completed file(s).
sq: Fshin skedën e zgjedhur të përfunduar.

source: Show downloads which are active.
sq: Tregon shkarkesat aktive.

source: Show all downloads.
sq: Tregon tërë shkarkesat.

source: Choose which types of downloads to show and which types to hide in this view.
sq: Zgjedh cilat shkarkesa do të shfaqen/fshihen nga pamja.

source: Show downloads which are paused.
sq: Tregon shkarkesat në pushim.

source: Show downloads which are waiting in queues.
sq: Tregon shkarkesat që presin në radhë.

source: Show downloads which are waiting for sources.
sq: Tregon shkarkesat që presin për burimet.

source: View help information on this download...
sq: Shikon për informacion ndihmës rreth shkarkesës...

source: Preview the selected file(s) in place.
sq: Parashikon në vend skedën e zgjedhur.

source: Open or play the selected file(s).
sq: Hap ose luan skedën e zgjedhur.

source: SmartPreview the selected download(s).
sq: Parashikon aty për aty shkarkesën e zgjedhur.

source: Open a download monitor window for this download...
sq: Hap dritaren për monitorimin e shkarkesës...

source: Move the selected download(s) down the priority list.
sq: Lëviz poshtë në listën e përparësisë shkarkesën e zgjedhur.

source: Move the selected download(s) up the priority list.
sq: Lëviz lart në listën e përparësisë shkarkesën e zgjedhur.

source: Pause the selected download(s).
sq: Pushon shkarkesën e zgjedhur.

source: Rate the selected download.
sq: Vlerëson shkarkesën e zgjedhur.

source: Download preview image for the selected download.
sq: Shkarkon një imazh parashikimi për shkarkesën e zgjedhur.

source: Resume the selected download(s).
sq: Rimerr shkarkesën e zgjedhur.

source: Configure download settings...
sq: Konfiguron vendosjet e shkarkimit...

source: Share this partially downloaded file with other users.
sq: Ndan skedën pjesërisht të shkarkuar me përdoruesit e tjerë.

source: Display sources which are not currently being used.
sq: Tregon burimet që aktualisht nuk përdoren.

source: Search for more sources for the selected download(s).
sq: Kërkon më tepër burime për shkarkesën e zgjedhur.

source: Add a source URL to the selected download...
sq: Shton një URL-burim në shkarkesën e zgjedhur...

source: Display the Shareaza about dialog...
sq: Tregon tabelën me informacionet e Shareaza-s...

source: All about codecs and video problems.
sq: Gjithçka për problemet me koduesit dhe videot.

source: View the Shareaza FAQ.
sq: Tregon pyetjet me përgjigje rreth Shareaza-s.

source: Visit the Shareaza Discussion Forums.
sq: Viziton forumet për diskutimet rreth Shareaza-s.

source: Visit the Shareaza Users Guide.
sq: Viziton guidën e përdoruesit të Shareaza-s.

source: Visit the Shareaza web site.
sq: Viziton truallin në rrjet të Shareaza-s.

source: Get help configuring your router or firewall.
sq: Ndihmon në konfigurimin e ruterit ose fajruollit.

source: Help protecting your system from hostile programs.
sq: Ndihmon në mbrojtjen e sistemit nga programet keqbërëse.

source: Run the connection test.
sq: Vepron testin e lidhjes.

source: Check for news and updates.
sq: Verifikon për lajmet dhe ridatimet.

source: Visit this website
sq: Viziton truallin

source: Clear the hit monitor buffer.
sq: Pastron zbutësin e monitorimit të hiteve.

source: Pause hit monitoring.
sq: Pushon monitorimin e hiteve.

source: Search the network for the selected term.
sq: Kërkon në rrjet për termin e zgjedhur.

source: Connect to the selected host(s).
sq: Lidhet te hosti i zgjedhur.

source: Disconnect from the selected neighbour(s).
sq: Shkëputet nga hosti i zgjedhur.

source: Show eDonkey servers.
sq: Tregon serverat eDonkey.

source: Download an eDonkey "server.met" file...
sq: Shkarkon skedën nga eDonkey "server.met"...

source: Show Gnutella1 cached hosts.
sq: Tregon hostet në depot e Gnutella1.

source: Show Gnutella2 cached hosts.
sq: Tregon hostet në depot e Gnutella2.

source: Show Gnutella2 horizon hubs.
sq: Tregon nyjat në horizont të Gnutella2.

source: Import a list of known hosts, such as a "server.met" file...
sq: Importon listën me hostet e njohura, p.sh. skedën "server.met"...

source: Try to connect to this server before other servers.
sq: Provon të lidhet me një server para të tjerëve.

source: Remove the selected hosts from the host cache.
sq: Fshin hostin e zgjedhur nga depoja e hosteve.

source: Add a new folder to your library...
sq: Shton një dosje të re në librari...

source: Delete the selected album folder.
sq: Fshin dosjen e zgjedhur me albume.

source: Open the selected album folder.
sq: Hap dosjen e zgjedhur me albume.

source: View and edit the properties of the selected album folder...
sq: Tregon dhe editon vetitë e dosjes së zgjedhur me albume...

source: Select metadata columns to be displayed...
sq: Zgjedh kolonat me metadatat që do të shfaqen...

source: Copy the selected files to another library folder...
sq: Kopjon skedën e zgjedhur në një dosje tjetër në librari...

source: Create a .torrent for this file to upload to a website.
sq: Krijon një .torrent për skedën që ajo të ngarkohet në truall.

source: Delete the selected files permanently.
sq: Fshin përgjithmonë skedën e zgjedhur.

source: Add the selected file(s) to your media playlist.
sq: Shton skedën e zgjedhur në listën me mediat.

source: Open the selected folder(s).
sq: Hap dosjen e zgjedhur.

source: Export the selected album folder to collection files...
sq: Eksporton dosjen e zgjedhur me albume tek një skedëkoleksion...

source: Download all files in the selected collection.
sq: Shkarkon tërë skedat në koleksionin e zgjedhur.

source: Add every file in the selected album folder(s) to your playlist.
sq: Shton në listë çdo skedë në dosjen e zgjedhur me albume.

source: View and edit the properties of all files in the selected folder(s)...
sq: Tregon dhe editon vetitë e tërë skedave në dosjen e zgjedhur...

source: Apply common metadata from the album folder to all of its files.
sq: Zbaton metadatat e zakonshme nga dosja me albume në tërë skedat e saj.

source: Create a new album folder here...
sq: Krijon një dosje të re me albume...

source: Manage the physical folders in your library...
sq: Menaxhon dosjet fizike në librari...

source: Boost the speed of file scanning and hashing.
sq: Shtyn shpejtësinë e skanimit dhe të grirjes së skedës.

source: Move the selected files to another library folder...
sq: Lëviz skedën e zgjedhur në një dosje tjetër në librari...

source: Show or hide the library detail panel.
sq: Tregon ose fsheh panelin me detaje të librarisë.

source: Move up to the parent folder.
sq: Lëviz sipër në dosjen mëmë.

source: View and edit the properties of the selected files...
sq: Tregon dhe editon vetitë e skedës së zgjedhur...

source: Rebuild metadata and hashes for the selected folders or files.
sq: Rindërton metadatat dhe hashet për dosjen apo skedën e zgjedhur.

source: Rebuild metadata using other language.
sq: Rindërton metadatat duke përdorur një gjuhë tjetër.

source: Refresh the library view.
sq: Rifreskon pamjen e librarisë.

source: Remove the selected shared folders.
sq: Fshin dosjen e zgjedhur që shpërndahet.

source: Rename the selected file in-place.
sq: Riemërton në vend skedën e zgjedhur.

source: Scan the selected folders or files for changes.
sq: Skanon për ndryshime dosjen apo skedën e zgjedhur.

source: Search your file library...
sq: Kërkon librarinë e skedës...

source: Seed the selected Torrent on BitTorrent.
sq: Mbjell torrentin e zgjedhur në BitTorrent.

source: Select and view all folders in your library.
sq: Zgjedh dhe tregon tërë dosjet në librari.

source: Share or unshare the selected files.
sq: Shpërndan ose nuk e shpërndan skedën e zgjedhur.

source: Share or unshare the selected folder(s).
sq: Shpërndan ose nuk e shpërndan dosjen e zgjedhur.

source: View the physical folders in your library.
sq: Tregon dosjet fizike në librari.

source: Organise your library.
sq: Organizon librarinë.

source: Remove the select files from the current album folder.
sq: Fshin skedën e zgjedhur nga dosja aktuale me albumet.

source: Select a library view...
sq: Zgjedh pamjen e librarisë...

source: Show an album view
sq: Tregon pamjen e një albumi

source: Album View
sq: Me Album

source: Show the rich collection view
sq: Tregon pamjen me koleksion të pasur

source: Collection View
sq: Me Koleksion

source: Show file name, details and metadata
sq: Tregon emrin, detajet dhe metadatat e skedës

source: Detail View
sq: Me Detaje

source: Library home page view
sq: Tregon faqen zyrtare të librarisë

source: Home View
sq: Me Shtëpi

source: Show files as icons
sq: Tregon skedat si ikona

source: Icon View
sq: Me Ikonë

source: Show files in a horizontal list
sq: Tregon skedat sipas listës horizontale

source: List View
sq: Me Listë

source: Show thumbnails for files
sq: Tregon skedat si foto

source: Thumbnail View
sq: Me Skicë

source: Show a list of album folders.
sq: Tregon listën e dosjeve me albume.

source: Tile View
sq: Me Pjesë

source: Add a media file to the playlist...
sq: Shton në listë një skedë mediatike...

source: Add a folder of media files to the playlist...
sq: Shton në listë një dosje të skedave mediatike...

source: Lock video to 16:9 aspect ratio, suitable for film.
sq: Bllokon raportin 16:9 për pamjen e videos, që përshtatet për filmat.

source: Lock video to 4:3 aspect ratio, suitable for TV.
sq: Bllokon raportin 4:3 për pamjen e videos, që përshtatet për TV.

source: Use the video's default aspect ratio.
sq: Përdor raportin tipik të pamjes së videos.

source: Clear (empty) the playlist.
sq: Pastron (boshatis) listën.

source: Close the current media file, freeing up memory.
sq: Mbyll skedën mediatike aktuale dhe e lëshon në kujtesë.

source: Save the playlist as a collection file...
sq: Ruan listën si skedë koleksioni...

source: Toggle full-screen video mode.
sq: Nyjëzo mënyrën filmike me ekran të plotë.

source: Mute audio playback
sq: Heq zërin e pjesës

source: Skip ahead to the next file in the current playlist.
sq: Kalon përpara në skedën tjetër të listës aktuale.

source: Next File
sq: Skedë e Parme

source: Open and play a media file or playlist...
sq: Hap dhe luan një skedë mediatike ose listë...

source: Pause playback of the media file.
sq: Pushon lojën e skedës mediatike.

source: Start playing the current media file.
sq: Nis lojën e skedës mediatike aktuale.

source: Play
sq: Luaj

source: Show or hide the playlist editor.
sq: Tregon ose fsheh editorin e listës.

source: Skip back to the previous file in the current playlist.
sq: Kalon pas në skedën tjetër të listës aktuale.

source: Previous File
sq: Skedë e Pasme

source: View and edit the properties of the selected files.
sq: Tregon dhe editon vetitë e skedës së zgjedhur.

source: Toggle random (shuffle) mode in the current playlist.
sq: Nyjëzo mënyrën rastësore (përzierë) në listën aktuale.

source: Rate the selected files.
sq: Vlerëson skedën e zgjedhur.

source: Remove the selected media file from the playlist.
sq: Fshin nga lista skedën mediatike të zgjedhur.

source: Repeat the current media file.
sq: Përsërit skedën mediatike aktuale.

source: Save the current playlist to a file...
sq: Ruan në skedë listën aktuale...

source: Select and play this file.
sq: Zgjedh dhe luan skedën.

source: Display the media settings page...
sq: Tregon faqen e vendosjeve të medias...

source: Stretch the video to fill the window, potentially distorting it.
sq: Zgjeron videon për të mbushur dritaren, ka mundësi të shtrembërohet.

source: Choose the best size for the video based on its aspect ratio.
sq: Zgjedh masën më të mirë të videos bazuar në raportin e aspektit.

source: Show the video at its original (natural) size.
sq: Tregon videon në masën origjinale (natyrale).

source: Show the video at triple its original (natural) size.
sq: Tregon videon me masë trefishe nga origjinali (natyrale).

source: Show the video at double its original (natural) size.
sq: Tregon videon me masë dyfishe nga origjinali (natyrale).

source: Speed
sq: Shpejtësi

source: Show or hide the media status line.
sq: Tregon ose fsheh vijën e statusit të medias.

source: Stop playing the media file.
sq: Ndalon lojën e skedës mediatike.

source: Select an audio visualisation plugin...
sq: Zgjedh spinën e vegimit zanor...

source: Adjust video zoom and aspect ratio settings.
sq: Ndreq zmadhimin e videos dhe vendosjet për raportin e aspektit.

source: Close the monitor window.
sq: Mbyll dritaren e monitorit.

source: Open a chat session with the selected user.
sq: Hap një sesion chat-i me përdoruesin e zgjedhur.

source: Copy a URI to access the selected host.
sq: Kopjon një URI që të hapet hosti i zgjedhur.

source: Disconnect the selected neighbour(s).
sq: Shkëput fqinjët e zgjedhur.

source: Configure network settings...
sq: Konfiguron vendosjet e rrjetit...

source: Open a new Packet Dump window monitoring this neighbour.
sq: Hap dritaren e re Skuta Pakete për monitorimin e fqinjit.

source: Open a new Packet Dump window monitoring incoming traffic from this neighbour.
sq: Hap dritaren e re Skuta Pakete për monitorimin e trafikut hyrës nga fqinji.

source: Open a new Packet Dump window monitoring outgoing traffic to this neighbour.
sq: Hap dritaren e re Skuta Pakete për monitorimin e trafikut dalës nga fqinji.

source: Automatically close Shareaza when transfers have completed.
sq: Shareaza do të mbyllet automatikisht kur transferimi të përfundojë.

source: Browse a user, showing their profile and shared files...
sq: Shfleton një përdorues, duke shfaqur profilin dhe skedat që shpërndan...

source: Connect to selected networks.
sq: Lidhet në rrjet.

source: Manually connect to a host...
sq: Lidhet me porosi në host...

source: Disconnect from all networks, this will also stop all downloads and uploads.
sq: Shkëputet nga rrjeti.

source: Connect to the eDonkey network.
sq: Lidhet tek rrjeti eDonkey.

source: Exit Shareaza
sq: Shareaza do të mbyllet.

source: Connect to the original Gnutella network.
sq: Lidhet tek rrjeti origjinal Gnutella.

source: Connect to the Gnutella2 network (highly recommended).
sq: Lidhet tek rrjeti Gnutella2 (rekomandohet fort).

source: Start a new search of the network...
sq: Nis një kërkim të ri në rrjet...

source: Clear the search results.
sq: Pastron rezultatet e kërkimit.

source: Display detailed information on the selected file.
sq: Tregon informacion me detaje për skedën e zgjedhur.

source: Download the selected file(s).
sq: Shkarkon skedën e zgjedhur.

source: Download the selected file(s) with priority.
sq: Shkarkon me përparësi skedën e zgjedhur.

source: Filter the search results by certain words and conditions...
sq: Filtron rezultatet e kërkimit sipas një fjale dhe kushti të caktuar...

source: Remove filtering from the results.
sq: Fshin filtrin e rezultateve.

source: Search for music files in the same album as the selected file.
sq: Kërkon skedat muzikore nga i njëjti album si i skedës së zgjedhur.

source: Search for music files by the same artist as the selected file.
sq: Kërkon skedat muzikore nga i njëjti artist si i skedës së zgjedhur.

source: Search for video files in the same series as the selected file.
sq: Kërkon skedat filmike nga i njëjti serial si i skedës së zgjedhur.

source: Search for files which are similar to the selected file.
sq: Kërkon skedat e ngjashme me skedën e zgjedhur.

source: Search for other copies of the selected file.
sq: Kërkon kopjen tjetër të skedës së zgjedhur.

source: Display the quick search panel on the left of the Search window.
sq: Tregon panelin e kërkimit të shpejtë majtas dritares Kërko.

source: Search the network again...
sq: Kërkon përsëri rrjetin...

source: Stop receiving results in this window.
sq: Ndalon marrjen e rezultateve në dritare.

source: Clear the search monitor buffer.
sq: Pastron zbutësin e monitorit kërkues.

source: Pause search monitoring.
sq: Pushon monitorimin e kërkimit.

source: Add a new rule to the security chain...
sq: Shton një rregull të ri tek zinxhiri i sigurisë...

source: Ban the selected host for the duration of this session.
sq: Dëbon hostin e zgjedhur për zgjatje të sesionit.

source: Edit the selected security rule...
sq: Editon rregullin e zgjedhur të sigurisë...

source: Export the selected security rules to a file...
sq: Eksporton në skedë rregullin e zgjedhur të sigurisë...

source: Import security rules from a file...
sq: Importon nga një skedë rregullat e sigurisë...

source: Move the selected security rules down the precedence list.
sq: Lëviz poshtë në listën e përparësive rregullat e zgjedhur të sigurisë.

source: Move the selected security rules up the precedence list.
sq: Lëviz lart në listën e përparësive rregullat e zgjedhur të sigurisë.

source: Set the default security policy to allow all hosts.
sq: Vendos dëftesën e sigurisë tipike për të lejuar tërë hostet.

source: Set the default security policy to deny all hosts.
sq: Vendos dëftesën e sigurisë tipike për të mohuar tërë hostet.

source: Remove the selected security rules.
sq: Fshin rregullin e zgjedhur të sigurisë.

source: Reset the hit counts on the selected rules.
sq: Rivendos numërimin e hiteve në rregullin e zgjedhur.

source: Clear the status log.
sq: Pastron ditarin e statusit.

source: Record a timestamp for each line.
sq: Regjistron shtypjen e kohës për secilën vijë.

source: Display a detailed system activity log.
sq: Tregon një ditar me detaje për aktivitetet e sistemit.

source: Connect or disconnect from the network.
sq: Lidh ose shkëput rrjetin.
